hi = { 'ru' : "Привет,", 
       'uk' : "Привiт," } 

hi_start =  {   'ru' : '\nЯ твой бот-друг, можешь звать меня Панда🐼.\nДавай сначала разберёмся как к тебе обращаться :)',
                'uk' : '\nЯ твій бот-друг, можеш звати мене Панда🐼.\nДавай спочатку розберемось як до тебе звертатись :)',
                'en' : "Sorry, but this bot does not support your language 😔.\nYou can choose one of the available:"}

get_lang_start = {  'ru' : '1/3: Выбери язык комфортный для тебя:',
                    'uk' : '1/3: Обери мову комфортну для тебе:' }

again_hi_start = {  'ru' : 'Приятно увидеть тебя снова :)',
                    'uk' : 'Приємно побачити тебе знову :)' }

dont_know_start = { 'ru' : 'Извини, но я тебя не понимаю. 😔\nПожалуйста, выбери из предложенных:',
                    'uk' : 'Вибач, але я тебе не розумію. 😔\nБудь ласка, вибери з запропонованих:' }

new_user_menu = { 'ru' : 'Отлично! Перенаправляю тебя в меню. 🙂',
                  'uk' : 'Чудово! Перенаправляю тебе до меню. 🙂'  }

empty_ask = { 'ru' : 'Напиши свой вопрос, или просто накричи на Админа. Как хочешь 🙂',
              'uk' : 'Напиши своє питання, чи просто накричи на Адміна. Як хочеш 🙂'  }

duff = ['Пиздобратия мандопроушечная', 'Уёбище залупоглазое', 'Дрочепиздище хуеголовое', 'Пробиздоблядская мандопроушина', 
'Гнидопаскудная хуемандовина', 'Блядь ты семитаборная','Охуевшее блядепиздопроёбище', 'Хуй тебе в глотку через анальный проход', 
'Распизди тебя тройным перебором через вторичный переёб', 'Пиздоблятское хуепиздрическое мудовафлоебище сосущее километры трипперных членов', 
'Трихломидозопиздоеблохуеблядеперепиздическая спермоблевотина', 'Гондон с гонореей....', 
'Да разъебись ты троебучим проебом сперматоблятская пиздапроебина охуевающая в своей пидарастической сущности похожаю на ебущегося в жопу енота, сортирующего яйца в пизде кастрированной кобылы', 
'Хуелептический пиздопрозоид, еблоухий мандохвост', 'Ебун хуеголовый', 'Пидрасня ебаная', 'Залупоголовая блядоящерица', 'Трипиздоблядская промудохуина!', 
'Распроеб твою в крестище через коромысло в копейку мать', 'Что за блядская пиздопроебина, охуевающая своей пидорестической заебучестью невъебенной степени охуения.', 
'Заебись невъебенным проебом тримандоблядская пиздопроебина воспиздозаолупоклинившаяся в собственном злопиздии', 
'Что сидишь, как лунь пизду склевавший, мордоблядина залупоглазая. Ебись ты триебучим проебом пиздуй пока трамваи ходят, склипездень двужопостворчатый', 
'Злоебучее страхопиздище трипиздоблятский мандопроеб найвыебенищее распиздоблятство!', 'Застрявший в ебенгво гавнопрягопизд отпизднутый', 'Хуеблища и ебанагандонный хуепедераст', 
'Мудагавнопердь', 'Стоебучее страхопиздище охуевающее в собственной пидарастической злоебучести', 'Cемиголовый восьмихуй с четырьмя пиздопроебинами', 
'Облямудевшая страпиздихуюлина', 'Пидористический мудаблядин', 'Трипездоклятый мудопроеб', 'Промудохуеблядская пиздопроебина невьебенно охуевающая от своей собственной облядипизденелости', 
'Трипиздоблядское мудопроебное трипиздие', 'Ебоблядище охуевающее от собственной злоебучести', 'Облямуденный злоебучий страхопизднутый трихуемандаблядский ебаквакнутый', 
'Да разъебись ты триебучим проебом хуепуполо залупоглазое, промонодблядская трипиздыпроебина', 'Хуеблядская пиздопроебина', 
'Да разъебись ты тризлоебучим пробиздом тримандаблядская пиздопроушина охуевающая от собственного блядского невъебения!!', 'Высохший аналомокроблядник', 'Жирномногоканальный блядохероблядник', 
'Пизданутый попечитель мочалок', 'Толстомудый и плюшевый муфлон', 'Жирномногоканальный говноед']

name_sex = ['Александром', 'Сашей','Алексеем','Алиной','Анастасией','Анатолием',
'Анной','Арсеном','Богданом','Булатом', 'Васей','Вероникой','Виктором','Викторией',
'Виталием','Владом', 'Геннадием', 'Давидом','Данилом','Дариной','Дарьей','Дениской','Димой', 'Женей', 'Егором','Катей','Леной','Елизаветой',
'Ириной','Кариной', 'Максимом','Маратом','Марией','Милена','Мухаммедом','Надеждой','Никой','Оксаной','Ольгой','Полиной','Райаном Гослингом','Маргаритой','Сергеем',
'Софией','Стасом','Татьяной','Яной','Денисом', 'Cобой', 'никем']