ru = {
            'hi_start' : '\nЯ твой новый друг :)\nВыбери язык комфортный для тебя: ',
            'bye' : "Ладно, покаа",
            'button_male' : "Я парень 🧔🏽‍♂️",
            'button_female' : "Я девушка 👱🏼‍♀️"  
    
        }

uk = {
            'hi_start' : '\nЯ твій новий друг :)\nОбери мову комфортну для тебе: ',
            'bye' : "Гаразд, буваай",
            'button_male' : "Я хлопець 🧔🏽‍♂️",
            'button_female' : "Я дівчина 👱🏼‍♀️",
            'ru' : 'Всё океюшки'
        } 

en = {
            'error' : "Sorry, but this bot does not support your language 😔.\nYou can choose one of the available:"
        } 


hi = { 'ru' : "Привет,", 
       'uk' : "Привiт," } 

hi_start =  {   'ru' : '\nЯ твой новый друг :)\nВыбери язык комфортный для тебя: ',
                'uk' : '\nЯ твій новий друг :)\nОбери мову комфортну для тебе: ',
                'en' : "Sorry, but this bot does not support your language 😔.\nYou can choose one of the available:"}

again_hi_start = {  'ru' : 'Приятно увидеть тебя снова :)',
                    'uk' : 'Приємно побачити тебе знову :)' }
