start_sign_up = { 'ru_bot_start': '\nЯ твой бот-друг, можешь звать меня Панда 🐼.\nДавай сначала разберёмся как к тебе обращаться :)\nНажимай книпку ниже, чтоб выбрать язык, имя и пол:',
              'uk_bot_start': '\nЯ твій бот-друг, можеш звати мене Панда 🐼.\nДавай спочатку розберемось як до тебе звертатись :)\nНатискай кнопку нижче, щоб ввести мову, ім`я та стать:',
              'en_bot_start': "Sorry, but this bot does not support your language 😔.\nYou can choose one of the available:",

              'ru_start_1/3': '1/3: Выбери язык комфортный для тебя:',
              'uk_start_1/3': '1/3: Обери мову комфортну для тебе:',

              'ru_start_2/3': 'Отлично!\n2/3: Как мне тебя называть? 🙂',
              'uk_start_2/3': 'Чудово! \n2/3: Як мені тебе називати? 🙂',

              'ru_start_too_long_name': 'Слишком длинное имя, давай покороче 😥',
              'uk_start_too_long_name': 'Надто довге ім`я, давай більш коротко 😥',

              'ru_start_3/3': 'Хорошо!\n3/3: Ты парень или девушка? 🚻',
              'uk_start_3/3': 'Гаразд!\n3/3: Ти хлопець чи дівчина? 🚻',

              'ru_dont_know_start' : 'Извини, но я тебя не понимаю. 😔\nПожалуйста, выбери из предложенных:',
              'uk_dont_know_start' : 'Вибач, але я тебе не розумію. 😔\nБудь ласка, вибери iз запропонованих:',

              'ru_again_bot_start' : 'Приятно увидеть тебя снова :)', 
              'uk_again_bot_start' : 'Приємно побачити тебе знову :)'}

reverse_info = {'ru_lang':         'Хорошо! Вы изменили язык на русский',
                'uk_lang':         'Добре! Ви змінили мову на українську.',
                'ru_gender':       'Хорошо! Вы поменяли пол',
                'uk_gender':       'Добре! Ви змінили стать',
                'ru_notice':       'Хорошо! Вы изменили уведомления',
                'uk_notice':       'Добре! Ви змінили повідомлення',
                'uk_name':         'Хорошо! Вы изменили имя',
                'ru_name':         'Добре! Ви змінили ім`я', }

general_text = {'ru_hello':               "Привет",
                'uk_hello':               "Привiт",

                'ru_setting':             '<b>⚙️ Настройки: </b>',
                'uk_setting':             '<b>⚙️ Налаштування: </b>',

                'ru_to_menu':       'Cупер! Перенаправляю тебя в меню. 🙂',
                'uk_to_menu':       'Cупер! Перенаправляю тебе до меню. 🙂',    

                'ru_dont_know_text':      'Я не знаю что тебе ответить :(',
                'uk_dont_know_text':      'Я не знаю що тобі відповісти :(',

                'ru_send_ask':            'Твоё сообщение отправлено!',
                'uk_send_ask':            'Твоє повідомлення відправлено!',

                'ru_empty_ask':           'Напиши свой вопрос, или просто накричи на Админа. Как хочешь 🙂',
                'uk_empty_ask':           'Напиши своє питання, чи просто накричи на Адміна. Як хочеш 🙂',

                'ru_help_menu':           'Here:\n/start - Старт, общий запуск\n/poh - Пнуть Админа\n/ask - Сообщение админу ( /ask <em>your text</em> )"\n/feedback - Прямая связь с автором',
                'uk_help_menu':           'Here:\n/start - Старт, загальний запуск\n/poh - Пнути Адмiна\n/ask - Повідомлення Aдмiну ( /ask <em>your text</em> )"\n/feedback - Прямий зв`язок з автором',

                "ru_set_name":            'Как мне тебя называть? 🙂',
                "uk_set_name":            'Як мені до тебе звертатись? 🙂',

                'ru_ask_admin_no':        'Хорошо, в другой раз! :)',
                'uk_ask_admin_no':        'Добре, в інший раз! :)',        

                'ru_menu_text':           '🔸                <b>Главное меню</b>                🔸\n\nЗдесь ты можешь пользоваться моими функциями.',
                'uk_menu_text':           '🔸                <b>Головне меню</b>                🔸\n\nТут ти можеш користуватися моїми функціями.',             

                'ru_ask_admin_yes':       'Хорошо! Твое сообщение отправлено Админу :)',
                'uk_ask_admin_yes':       'Добре! Твоє повідомлення відправлено Адміну :)',

                'ru_list_tests':          'Вот cписок доступных тестов:',
                'uk_list_tests':          'Ось список доступних тестів:',
                       
                'ru_feedback_yes':        'Говорят, через это меню можно поговорить с автором бота. Точно хочешь? 🙂',
                'uk_feedback_yes':        'Кажуть, через це меню можна поговорити з автором бота. Точно хочеш? 🙂',
                       
                'ru_feedback_ok':         'Хорошо! Когда-нибудь с тобой свяжутся 😉 (или нет)\n Ты можешь просто написать ему: @alexnerw\nА пока что перенаправляю в тебя меню:',
                'ru_feedback_ok':         "Добре! Коли-небудь з тобою зв'яжуться 😉 (або ні)\n       Ти можеш просто написати йому: @alexnerw\n А поки що перенаправляю тебе до меню"}                          

test_depression_beka = {'answer_1_ru': '<b>Вопрос №1/21</b>:\n\n'

              '▫️ <b>1.</b> Я не испытываю печали\n\n'
              '▫️ <b>2.</b> Я подавлен и печален\n\n'
              '▫️ <b>3.</b> Я страдаю от тоски и подавленности\n\n'
              '▫️ <b>4.</b> Я настолько несчастен, что я больше не могу этого выносить',

       'answer_1_uk': '<b>Запитання №1/21</b>:\n\n'
              '▫️ <b>1.</b> Я не відчуваю смутку\n\n'
              '▫️ <b>2.</b> Я пригнічений і сумний\n\n'
              '▫️ <b>3.</b> Я страждаю від туги та пригніченості\n\n'
              '▫️ <b>4.</b> Я настільки нещасний, що я більше не можу цього виносити', 

       'answer_2_ru': '<b>Вопрос №2/21</b>:\n\n'
              '▫️ <b>1.</b> Будущее не подавляет и не пугает меня\n\n'
              '▫️ <b>2.</b> Будущее меня пугает\n\n'
              '▫️ <b>3.</b> Я чувствую, что будущее совсем ничего не может мне предложить\n\n'
              '▫️ <b>4.</b> Я чувствую, что будущее безнадежно, и не могу поверить, что что-то изменится в лучшую сторону',

       'answer_2_uk': '<b>Запитання №2/21</b>:\n\n'
              '▫️ <b>1.</b> Майбутнє не пригнічує і не лякає мене\n\n'
              '▫️ <b>2.</b> Майбутнє мене лякає\n\n'
              '▫️ <b>3.</b> Я відчуваю, що майбутнє зовсім нічого не може мені запропонувати\n\n'
              '▫️ <b>4.</b> Я відчуваю, що майбутнє безнадійне, і не можу повірити, що щось зміниться на краще',

       'answer_3_ru': '<b>Вопрос №3/21</b>:\n\n'
              '▫️ <b>1.</b> Я не чувствую себя неудачником\n\n'
              '▫️ <b>2.</b> Я чувствую, что неудачлив больше, чем другие\n\n'
              '▫️ <b>3.</b> В прошлом я вижу лишь серию неудач\n\n'
              '▫️ <b>4.</b> Я ощущаю себя полным неудачником',

       'answer_3_uk': '<b>Запитання №3/21</b>:\n\n'
              '▫️ <b>1.</b> Я не почуваюся невдахою\n\n'
              '▫️ <b>2.</b> Я відчуваю, що невдачливий більше, ніж інші\n\n'
              '▫️ <b>3.</b> У минулому я бачу лише серію невдач\n\n'
              '▫️ <b>4.</b> Я відчуваю себе повним невдахою',
                     
       'answer_4_ru': '<b>Вопрос №4/21</b>:\n\n'
              '▫️ <b>1.</b> Я не испытываю безразличия\n\n'
              '▫️ <b>2.</b> Вещи и события не радуют меня, как раньше\n\n'
              '▫️ <b>3.</b> Мне кажется, что я вообще ни от чего не получаю удовлетворения\n\n'
              '▫️ <b>4.</b> Я ничего не хочу и всем недоволен',

       'answer_4_uk': '<b>Запитання №4/21</b>:\n\n'
              '▫️ <b>1.</b> Я не відчуваю байдужості\n\n'
              '▫️ <b>2.</b> Речі та події не радують мене, як раніше\n\n'
              '▫️ <b>3.</b> Мені здається, що я взагалі ні від чого не отримую задоволення\n\n'
              '▫️ <b>4.</b> Я нічого не хочу і всім незадоволений',
                            
       'answer_5_ru': '<b>Вопрос №5/21</b>:\n\n'
              '▫️ <b>1.</b> Я не чувствую никакой вины за собой\n\n'
              '▫️ <b>2.</b> Я чувствую себя плохим и никчемным человеком\n\n'
              '▫️ <b>3.</b> Я чувствую себя плохим и никчемным практически всегда\n\n'
              '▫️ <b>4.</b> Я чувствую себя очень плохим и ненужным',

       'answer_5_uk': '<b>Запитання №5/21</b>:\n\n'
              '▫️ <b>1.</b> Я не відчуваю жодної провини за собою\n\n'
              '▫️ <b>2.</b> Я почуваюся поганою і нікчемною людиною\n\n'
              '▫️ <b>3.</b> Я відчуваю себе поганим і нікчемним практично завжди\n\n'
              '▫️ <b>4.</b> Я почуваюся дуже поганим та непотрібним',
              
       'answer_6_ru': '<b>Вопрос №6/21</b>:\n\n'
              '▫️ <b>1.</b> Я не думаю, что меня накажут\n\n'
              '▫️ <b>2.</b> Я чувствую, что со мной может случиться что-то плохое\n\n'
              '▫️ <b>3.</b> Я верю, что меня судьба меня накажет\n\n'
              '▫️ <b>4.</b> Я знаю, что я совершал такие поступки, за которые меня следует наказать',

       'answer_6_uk': '<b>Запитання №6/21</b>:\n\n'
              '▫️ <b>1.</b> Я не думаю, що мене покарають\n\n'
              '▫️ <b>2.</b> Я відчуваю, що зі мною може статися щось погане\n\n'
              '▫️ <b>3.</b> Я вірю, що мене доля мене покарає\n\n'
              '▫️ <b>4.</b> Я знаю, що я робив такі вчинки, за які мене слід покарати',
              
       'answer_7_ru': '<b>Вопрос №7/21</b>:\n\n'
              '▫️ <b>1.</b> Я не разочарован в себе\n\n'
              '▫️ <b>2.</b> Я разочарован в себе\n\n'
              '▫️ <b>3.</b> Я зол на себя\n\n'
              '▫️ <b>4.</b> Я ненавижу себя',

       'answer_7_uk':'<b>Запитання №7/21</b>:\n\n'
              '▫️ <b>1.</b> Я не розчарований у собі\n\n'
              '▫️ <b>2.</b> Я розчарований у собі\n\n'
              '▫️ <b>3.</b> Я злий на себе\n\n'
              '▫️ <b>4.</b> Я ненавиджу себе',
              
       'answer_8_ru': '<b>Вопрос №8/21</b>:\n\n'
              '▫️ <b>1.</b> Я не считаю себя хуже других\n\n'
              '▫️ <b>2.</b> Я критикую свои слабости\n\n'
              '▫️ <b>3.</b> Я виню себя за ошибки\n\n'
              '▫️ <b>4.</b> Я виню себя за все, что идет не так',

       'answer_8_uk': '<b>Запитання №8/21</b>:\n\n'
              '▫️ <b>1.</b> Я не вважаю себе гірше за інших\n\n'
              '▫️ <b>2.</b> Я критикую свої слабкості\n\n'
              '▫️ <b>3.</b> Я звинувачую себе за помилки\n\n'
              '▫️ <b>4.</b> Я звинувачую себе за все, що йде не так',
              
       'answer_9_ru': '<b>Вопрос №9/21</b>:\n\n'
              '▫️ <b>1.</b> Я не думаю о том, чтобы нанести себе вред\n\n'
              '▫️ <b>2.</b> Я иногда думаю покончить с собой, но я не буду этого делать\n\n'
              '▫️ <b>3.</b> Я реально думаю о самоубийстве\n\n'
              '▫️ <b>4.</b> Я убью себя, как только представится возможность',

       'answer_9_uk': '<b>Запитання №9/21</b>:\n\n'
              '▫️ <b>1.</b> Я не думаю про те, щоб завдати собі шкоди\n\n'
              '▫️ <b>2.</b> Я іноді думаю накласти на себе руки, але я не робитиму цього\n\n'
              '▫️ <b>3.</b> Я реально думаю про самогубство\n\n'
              '▫️ <b>4.</b> Я вб`ю себе, як тільки з`явиться можливість',
              
       'answer_10_ru': '<b>Вопрос №10/21</b>:\n\n'
              '▫️ <b>1.</b> Я плачу не чаще обычного\n\n'
              '▫️ <b>2.</b> Сейчас я плачу чаще, чем обычно\n\n'
              '▫️ <b>3.</b> Я все время плачу\n\n'
              '▫️ <b>4.</b> Я не могу заплакать, даже когда я хочу',

       'answer_10_uk': '<b>Запитання №10/21</b>:\n\n'
              '▫️ <b>1.</b> Я плачу не частіше, ніж звичайно\n\n'
              '▫️ <b>2.</b> Зараз я плачу частіше, ніж зазвичай\n\n'
              '▫️ <b>3.</b> Я весь час плачу\n\n'
              '▫️ <b>4.</b> Я не можу заплакати, навіть коли я хочу',
              
       'answer_11_ru': '<b>Вопрос №11/21</b>:\n\n'
              '▫️ <b>1.</b> Я не более раздражен, чем обычно\n\n'
              '▫️ <b>2.</b> Я раздражаюсь легче, чем обычно\n\n'
              '▫️ <b>3.</b> Я все время раздражен\n\n'
              '▫️ <b>4.</b> Меня уже не задевают те вещи, которые раньше раздражали',

       'answer_11_uk': '<b>Запитання №11/21</b>:\n\n'
              '▫️ <b>1.</b> Я не більше роздратований, ніж зазвичай\n\n'
              '▫️ <b>2.</b> Я дратуюсь легше, ніж зазвичай\n\n'
              '▫️ <b>3.</b> Я весь час роздратований\n\n'
              '▫️ <b>4.</b> Мене вже не зачіпають ті речі, які раніше дратували',
              
       'answer_12_ru': '<b>Вопрос №12/21</b>:\n\n'
              '▫️ <b>1.</b> Люди интересны мне по-прежнему\n\n'
              '▫️ <b>2.</b> Другие люди интересуют меня меньше прежнего\n\n'
              '▫️ <b>3.</b> Я почти утратил интерес и чувства к другим людям\n\n'
              '▫️ <b>4.</b> Я полностью утратил интерес к людям и не обращаю на них внимания',

       'answer_12_uk': '<b>Запитання №12/21</b>:\n\n'
              '▫️ <b>1.</b> Люди цікаві мені як і раніше\n\n'
              '▫️ <b>2.</b> Інші люди цікавлять мене менше за колишнє\n\n'
              '▫️ <b>3.</b> Я майже втратив інтерес та почуття до інших людей\n\n'
              '▫️ <b>4.</b> Я повністю втратив інтерес до людей і не звертаю на них уваги',
              
       'answer_13_ru': '<b>Вопрос №13/21</b>:\n\n'
              '▫️ <b>1.</b> Я способен принимать решения, как и прежде\n\n'
              '▫️ <b>2.</b> Я стараюсь избегать принятия решений\n\n'
              '▫️ <b>3.</b> Мне очень трудно принимать решения\n\n'
              '▫️ <b>4.</b> Я больше вообще не могу принимать решения',

       'answer_13_uk': '<b>Запитання №13/21</b>:\n\n'
              '▫️ <b>1.</b> Я здатний приймати рішення, як і раніше\n\n'
              '▫️ <b>2.</b> Я намагаюся уникати прийняття рішень\n\n'
              '▫️ <b>3.</b> Мені дуже важко приймати рішення\n\n'
              '▫️ <b>4.</b> Я більше взагалі не можу приймати рішення',
              
       'answer_14_ru': '<b>Вопрос №14/21</b>:\n\n'
              '▫️ <b>1.</b> По-моему, мой внешний вид не изменился\n\n'
              '▫️ <b>2.</b> Я обеспокоен тем, что выгляжу постаревшим и непривлекательным\n\n'
              '▫️ <b>3.</b> По-моему, мой внешний вид полностью изменился и я не выгляжу больше привлекательным\n\n'
              '▫️ <b>4.</b> Я чувствую себя страшным и отталкивающим',

       'answer_14_uk': '<b>Запитання №14/21</b>:\n\n'
              '▫️ <b>1.</b> На мою думку, мій зовнішній вигляд не змінився\n\n'
              '▫️ <b>2.</b> Я стурбований тим, що виглядаю старим і непривабливим\n\n'
              '▫️ <b>3.</b> На мою думку, мій зовнішній вигляд повністю змінився і я не виглядаю більш привабливим\n\n'
              '▫️ <b>4.</b> Я відчуваю себе страшним і відразливим', 
              
       'answer_15_ru': '<b>Вопрос №15/21</b>:\n\n'
              '▫️ <b>1.</b> Моя работоспособность сохранилась на прежнем уровне\n\n'
              '▫️ <b>2.</b> Начало работы требует от меня дополнительных усилий\n\n'
              '▫️ <b>3.</b> Чтобы что-то сделать вовремя, мне нужно буквально заставлять себя\n\n'
              '▫️ <b>4.</b> Я совсем не могу работать',

       'answer_15_uk': '<b>Запитання №15/21</b>:\n\n'
              '▫️ <b>1.</b> Моя працездатність збереглася на колишньому рівні\n\n'
              '▫️ <b>2.</b> Початок роботи вимагає від мене додаткових зусиль\n\n'
              '▫️ <b>3.</b> Щоб щось зробити вчасно, мені потрібно буквально примушувати себе\n\n'
              '▫️ <b>4.</b> Я зовсім не можу працювати',
              
       'answer_16_ru': '<b>Вопрос №16/21</b>:\n\n'
              '▫️ <b>1.</b> Я сплю так же хорошо, как обычно\n\n'
              '▫️ <b>2.</b> По утрам я чувствую себя более усталым, чем раньше\n\n'
              '▫️ <b>3.</b> Я просыпаюсь на 2-3 часа раньше обычного и больше не могу уснуть\n\n'
              '▫️ <b>4.</b> Я просыпаюсь раньше обычного каждое утро и не могу проспать подряд более 5 часов',

       'answer_16_uk': '<b>Запитання №16/21</b>:\n\n'
              '▫️ <b>1.</b> Я сплю так само добре, як завжди\n\n'
              '▫️ <b>2.</b> Вранці я почуваюся більш стомленим, ніж раніше\n\n'
              '▫️ <b>3.</b> Я прокидаюся на 2-3 години раніше, ніж звичайно, і більше не можу заснути\n\n'
              '▫️ <b>4.</b> Я прокидаюся раніше, ніж звичайно, щоранку і не можу проспати поспіль більше 5 годин',
              
       'answer_17_ru': '<b>Вопрос №17/21</b>:\n\n'
              '▫️ <b>1.</b> Я устаю не больше обычного\n\n'
              '▫️ <b>2.</b> Я устаю быстрее, чем раньше\n\n'
              '▫️ <b>3.</b> Я устаю буквально на пустом месте\n\n'
              '▫️ <b>4.</b> Я настолько устал, что не могу ничего делать',

       'answer_17_uk': '<b>Запитання №17/21</b>:\n\n'
              '▫️ <b>1.</b> Я втомлююся не більше звичайного\n\n'
              '▫️ <b>2.</b> Я втомлююся швидше, ніж раніше\n\n'
              '▫️ <b>3.</b> Я втомлююся буквально на порожньому місці\n\n'
              '▫️ <b>4.</b> Я настільки втомився, що не можу нічого робити',
              
       'answer_18_ru': '<b>Вопрос №18/21</b>:\n\n'
              '▫️ <b>1.</b> Мой аппетит такой же, как и прежде\n\n'
              '▫️ <b>2.</b> Мой аппетит слабее, чем прежде\n\n'
              '▫️ <b>3.</b> Мой аппетит сильно ухудшился\n\n'
              '▫️ <b>4.</b> У меня вообще нет аппетита',

       'answer_18_uk': '<b>Запитання №18/21</b>:\n\n'
              '▫️ <b>1.</b> Мій апетит такий самий, як і раніше\n\n'
              '▫️ <b>2.</b> Мій апетит слабший, ніж раніше\n\n'
              '▫️ <b>3.</b> Мій апетит сильно погіршився\n\n'
              '▫️ <b>4.</b> У мене взагалі немає апетиту',
              
       'answer_19_ru': '<b>Вопрос №19/21</b>:\n\n'
              '▫️ <b>1.</b> Мой вес в последнее время сохранился на прежнем уровне\n\n'
              '▫️ <b>2.</b> Я похудел больше, чем на 3 кг\n\n'
              '▫️ <b>3.</b> Я похудел больше, чем на 5 кг\n\n'
              '▫️ <b>4.</b> Я похудел больше, чем на 8 кг',

       'answer_19_uk': '<b>Запитання №19/21</b>:\n\n'
              '▫️ <b>1.</b> Моя вага останнім часом збереглася на колишньому рівні\n\n'
              '▫️ <b>2.</b> Я схуд більше, ніж на 3 кг\n\n'
              '▫️ <b>3.</b> Я схуд більше, ніж на 5 кг\n\n'
              '▫️ <b>4.</b> Я схуд більше, ніж на 8 кг',
              
       'answer_20_ru': '<b>Вопрос №20/21</b>:\n\n'
              '▫️ <b>1.</b> Я думаю о своем здоровье не чаще, чем обычно\n\n'
              '▫️ <b>2.</b> Я все чаще замечаю разные боли и недомогания, расстройства желудка и запоры\n\n'
              '▫️ <b>3.</b> Я настолько внимательно слежу за тем, что чувствую и как я себя чувствую, что не могу думать ни о чем другом\n\n'
              '▫️ <b>4.</b> Я полностью погружен в мысли о своем здоровье и ощущениях',

       'answer_20_uk': '<b>Запитання №20/21</b>:\n\n'
              '▫️ <b>1.</b> Я думаю про своє здоров`я не частіше, ніж зазвичай\n\n'
              '▫️ <b>2.</b> Я все частіше помічаю різні болі та нездужання, розлади шлунка та запори\n\n'
              '▫️ <b>3.</b> Я настільки уважно стежу за тим, що відчуваю і як я почуваюся, що не можу думати ні про що інше\n\n'
              '▫️ <b>4.</b> Я повністю занурений у думки про своє здоров`я та відчуття',
              
       'answer_21_ru': '<b>Вопрос №21/21</b>:\n\n'
              '▫️ <b>1.</b> Мой интерес к половой жизни не изменился\n\n'
              '▫️ <b>2.</b> Мой интерес к половой жизни снизился\n\n'
              '▫️ <b>3.</b> Мой интерес к половой жизни значительно снизился\n\n'
              '▫️ <b>4.</b> Я полностью потерял интерес к половой жизни',

       'answer_21_uk':  '<b>Запитання №21/21</b>:\n\n'
              '▫️ <b>1.</b> Мій інтерес до статевого життя не змінився\n\n'
              '▫️ <b>2.</b> Мій інтерес до статевого життя знизився\n\n'
              '▫️ <b>3.</b> Мій інтерес до статевого життя значно знизився\n\n'
              '▫️ <b>4.</b> Я повністю втратив інтерес до статевого життя'}           
test_depression_beka_result = {'ru0-9': '<b>По результатам тестирования у тебя отсутствуют симптомы депрессии. </b>😌\n\n'
                            'Твоё психоэмоциональное состояние в норме и не вызывает никаких опасений.\n\n'
                            'Общайся, слушай музыку, занимайся спортом, употребляй нужные организму витамины, делай всё что тебя радует и скорее всего депрессия никогда тебя не застанет 😎',

                     'ru10-15': '<b>По результатам тестирования у тебя есть признаки легкой депрессии (субдепрессии). </b>😯\n\n'
                            'Но следует уметь принимать <i>«дождливое»</i> настроение и незачеты судьбы и знать: плохое расположение духа – еще далеко не депрессия.\n\n'
                            'Если у тебя лёгкая депрессия, ты обычно можешь справляться с повседневной жизнью, даже если тебе плохо.\n\n'
                            'Поговорить с кем-нибудь, заняться спортом или слушать музыку может помочь почувствовать себя лучше или, по крайней мере, не так плохо.\n\n'
                            '<b>Также очень важно давать себе высыпаться, есть важные для организма витамины и находиться на солнце, это стимулирует выработку '
                            '"гормона радости" и улучшает твоё самочувствие.</b>\n\n'
                            'Не стоит думать что депрессия просто плохое настроение которое пройдёт со временем.\n\n'  
                            'Обычно она легко проходит, когда человек решает проблему с помощью психотерапевта. 🙂',

                     'ru16-19': '<b>По результатам тестирования у тебя есть симптомы умеренной депрессии. 😯</b>\n\n'
                            'Депрессия на данном этапе создает определенные трудности для нормальной жизни и опасна быстрым переходом на следующую стадию.\n\n'
                            'Поговорить с кем-нибудь, заняться спортом или слушать музыку может помочь почувствовать себя лучше или, по крайней мере, не так плохо.\n\n'
                            '<b>Также очень важно давать себе высыпаться, есть важные для организма витамины и находиться на солнце, это стимулирует выработку '
                            '"гормона радости" и улучшает твоё самочувствие.</b>\n\n'
                            'На сегодняшний день депрессия является одной из самых распространенных причин больничных.\n\n'
                            'Рекомендую тебе обратиться за помощью к психотерапевту, пока она не причиняет существенных проблем',
                            
                     'ru20-29': '<b>По результатам тестирования у тебя есть признаки выраженной депрессии (средней тяжести). </b>😯\n\n'
                            'Депрессия на этой стадии создает преграды для нормальной жизни и легко может перейти в тяжелую депрессию. \n\n'
                            'Поговорить с кем-нибудь, заняться спортом или слушать музыку может помочь почувствовать себя лучше или, по крайней мере, не так плохо.\n\n'
                            '<b>Также очень важно давать себе высыпаться, есть важные для организма витамины и находиться на солнце, это стимулирует выработку '
                            '"гормона радости" и улучшает твоё самочувствие.</b>\n\n'
                            'Такое состояние нельзя оставлять без внимания и медицинского контроля, необходимо в обязательном порядке записаться на консультацию психолога.',

                     'ru30-63': '<b>По результатам тестирования у тебя есть симптомы тяжелой депрессии. </b>😯\n\n'
                            'Это последняя, самая опасная стадия депрессии, с которой вряд ли получится справиться в одиночку. \n\n'
                            'Рекомендую тебе в срочном порядке обратиться за помощью к психотерапевту.',
                     
                     'ru': "Многие используют слово \"депрессия\" для того, чтобы описать плохое настроение, печаль или просто, чтобы сказать, что они не в духе. \n\n"
                            "Следует помнить, что депрессия - не просто плохое настроение,а заболевание, которое требует вмешательства специалистов и достаточно хорошо поддается лечению.\n\n"
                            "<i>Несмотря на то, что данный тест дает достаточно точный результат, не стоит после его прохождения и получения результатов заниматься самолечением. </i>"
                            "<i>Тест стоит пройти даже тем, кто абсолютно уверен, что здоров. Некоторые утверждения из опросника покажутся вам странными, но многие из них справедливы для человека с заболеванием.</i>\n\n"
                            "Так что если вы считаете, будто депрессия — это когда кто-то приуныл от безделья, пора переосмыслить своё отношение.",

       '             uk': "Багато хто використовує слово \"депресія\" для того, щоб описати поганий настрій, смуток або просто, щоб сказати, що вони не в дусі. \n\n"
                            "Слід пам'ятати, що депресія - не просто поганий настрій, а захворювання, яке вимагає втручання фахівців і досить добре піддається лікуванню. n"
                            "<i>Незважаючи на те, що цей тест дає досить точний результат, не варто після його проходження та отримання результатів займатися самолікуванням. </i>"
                            "<i>Тест варто пройти навіть тим, хто абсолютно впевнений, що здоровий. Деякі твердження з опитувальника здадуться вам дивними, але багато з них справедливі для людини із захворюванням.</i>\n\n"
                            "Отже якщо ви вважаєте, ніби депресія - це коли хтось зажурився від неробства, настав час переосмислити своє ставлення.",

                     'uk0-9': '<b>За результатами тестування у тебе відсутні симптоми депресії. </b>😌\n\n'
                            'Твій психоемоційний стан у нормі і не викликає жодних побоювань.\n\n'
                            'Спілкуйся, слухай музику, займайся спортом, вживай потрібні організму вітаміни, роби те чому ти радієш та скоріш за все, депресія ніколи тебе не застане 😎',

                     'uk10-15': '<b>За результатами тесту у тебе є ознаки легкої депресії (субдепресії). </b>😬\n\n'
                            'Якщо в тебе легка депресія, ти можеш справлятися з повсякденним життям, навіть якщо тобі погано.\n\n'
                            'Але слід уміти приймати <i>«дощовий»</i> настрій і незаліки долі та знати: поганий настрій – ще далеко не депресія.\n\n'
                            'Поговорити з кимось, зайнятися спортом або слухати музику може допомогти відчути себе краще або, принаймні, не так погано.\n\n'
                            '<b>Також дуже важливо давати собі висипатися, їсти важливі для організму вітаміни та перебувати на сонці, це стимулює виробіток '
                            '"гормону радості" та покращує твоє самопочуття.</b>\n\n'
                            'Не варто думати, що депресія просто поганий настрій, який пройде з часом.\n\n'
                            'Зазвичай вона легко проходить, коли людина вирішує проблему за допомогою психотерапевта. 🙂',

                     'uk16-19': '<b>За результатами тесту у тебе є симптоми помірної депресії.</b>\n\n'
                            'Депресія на даному етапі створює певні труднощі для нормального життя і небезпечна швидким переходом на наступну стадію.\n\n'
                            'Поговорити з кимось, зайнятися спортом або слухати музику може допомогти відчути себе краще або, принаймні, не так погано.\n\n'
                            '<b>Також дуже важливо давати собі висипатися, їсти важливі для організму вітаміни та перебувати на сонці, це стимулює виробіток '
                            '"гормону радості" та покращує твоє самопочуття.</b>\n\n'
                            'На сьогоднішній день депресія є однією з найпоширеніших причин лікарняних.\n\n'
                            'Рекомендую тобі звернутися за допомогою до психотерапевта, поки вона не завдає значних проблем.',
                            
                     'uk20-29': '<b>За результатами тесту у тебе є ознаки вираженої депресії (середньої тяжкості). </b>😯\n\n'
                            'Депресія на цій стадії створює перепони для нормального життя, та легко може перейти у важку депресію. \n\n'
                            'Поговорити з кимось, зайнятися спортом або слухати музику може допомогти відчути себе краще або, принаймні, не так погано.\n\n'
                            '<b>Також дуже важливо давати собі висипатися, їсти важливі для організму вітаміни та перебувати на сонці, це стимулює виробіток '
                            '"гормону радості" та покращує твоє самопочуття.</b>\n\n'
                            'Такий стан не можна залишати без уваги та медичного контролю, необхідно обов`язково записатися на консультацію психолога.',

                     'uk30-63': '<b>За результатами тесту у тебе присутні симптоми тяжкої депресії. </b>😯\n\n'
                            'Це остання, найнебезпечніша стадія депресії, з якою навряд чи вдасться впоратися наодинці. \n\n'
                            'Рекомендую тобі терміново звернутися за допомогою до психотерапевта.'}                                        

test_worry_beka = {
       'answer_start_ru': "Насколько сильно Вас беспокоило данное ощущение за последнюю неделю:\n\n",
       'answer_start_ru': "Наскільки сильно Вас турбувало це відчуття за останній тиждень:\n\n",

       'answer_ru':  '▫️ <b>1.</b> Нет, это меня не беспокоило\n\n'
                     '▫️ <b>2.</b> Как обычно\n\n'
                     '▫️ <b>3.</b> Не очень сильно (неприятно, но я справляюсь)\n\n'
                     '▫️ <b>4.</b> Очень сильно',

       'answer_uk':  '▫️ <b>1.</b> Ні, це мене не турбувало\n\n'
                     '▫️ <b>2.</b> Як зазвичай\n\n'
                     '▫️ <b>3.</b> Не дуже сильно (неприємно, але я впораюся)\n\n'
                     '▫️ <b>4.</b> Дуже сильно', 
       
       'answer_1_ru': '<b>Вопрос №1/21</b>:\n' '<b>Ощущение онемения или покалывания в теле?</b>\n\n',

       'answer_1_uk': '<b>Запитання №1/21</b>:\n' '<b>Відчуття оніміння або поколювання в тілі?</b>\n\n', 

       'answer_2_ru': '<b>Вопрос №2/21</b>:\n' '<b>Ощущение жара?</b>\n\n',

       'answer_2_uk': '<b>Запитання №2/21</b>:\n' '<b>Відчуття жару?</b>\n\n',

       'answer_3_ru': '<b>Вопрос №3/21</b>:\n' '<b>Слабость в коленях/ногах?</b>\n\n',

       'answer_3_uk': '<b>Запитання №3/21</b>:\n' '<b>Слабкість у колінах/ногах?</b>\n\n',
                     
       'answer_4_ru': '<b>Вопрос №4/21</b>:\n' '<b>Невозможность расслабиться?</b>\n\n',

       'answer_4_uk': '<b>Запитання №4/21</b>:\n' '<b>Неможливість розслабитись?</b>\n\n',
                            
       'answer_5_ru': '<b>Вопрос №5/21</b>:\n' '<b>Страх, что произойдет самое плохое?</b>\n\n',

       'answer_5_uk': '<b>Запитання №5/21</b>:\n' '<b>Страх, що станеться найгірше?</b>\n\n',
              
       'answer_6_ru': '<b>Вопрос №6/21</b>:\n' '<b>Головокружение или ощущение легкости в голове?</b> \n\n',

       'answer_6_uk': '<b>Запитання №6/21</b>:\n' '<b>Запаморочення чи відчуття легкості в голові?</b> \n\n',
              
       'answer_7_ru': '<b>Вопрос №7/21</b>:\n' '<b>Учащенное сердцебиение?</b> \n\n',

       'answer_7_uk':'<b>Запитання №7/21</b>:\n' '<b>Прискорене серцебиття?</b> \n\n',
              
       'answer_8_ru': '<b>Вопрос №8/21</b>:\n' '<b>Пошатывание?</b> \n\n',

       'answer_8_uk': '<b>Запитання №8/21</b>:\n' '<b>Похитування?</b> \n\n',
              
       'answer_9_ru': '<b>Вопрос №9/21</b>:\n' '<b>Ужас или страх?</b> \n\n',

       'answer_9_uk': '<b>Запитання №9/21</b>:\n' '<b>Жах чи страх?</b>\n\n',

       'answer_10_ru': '<b>Вопрос №10/21</b>:\n'  '<b>Нервозность?</b>\n\n',

       'answer_10_uk': '<b>Запитання №10/21</b>:\n' '<b>Нервовість?</b>\n\n',
              
       'answer_11_ru': '<b>Вопрос №11/21</b>:\n' '<b>Ощущение удушья?</b>\n\n',

       'answer_11_uk': '<b>Запитання №11/21</b>:\n' '<b>Відчуття задухи?</b> \n\n',
              
       'answer_12_ru': '<b>Вопрос №12/21</b>:\n' '<b>Дрожь в руках?</b> \n\n',

       'answer_12_uk': '<b>Запитання №12/21</b>:\n' ' <b>Тремтіння в руках?</b> \n\n',
              
       'answer_13_ru': '<b>Вопрос №13/21</b>:\n' '<b>Дрожь в других частях тела?</b> \n\n',

       'answer_13_uk': '<b>Запитання №13/21</b>:\n' '<b>Тремтіння в інших частинах тіла?</b> \n\n',
              
       'answer_14_ru': '<b>Вопрос №14/21</b>:\n' '<b>Страх, что не можешь себя контролировать?</b> \n\n',

       'answer_14_uk': '<b>Запитання №14/21</b>:\n' '<b>Страх, що не можеш контролювати себе?</b> \n\n', 
              
       'answer_15_ru': '<b>Вопрос №15/21</b>:\n' '<b>Затрудненность дыхания?</b> \n\n',

       'answer_15_uk': '<b>Запитання №15/21</b>:\n' '<b>Утрудненість дихання?</b>\n\n',
              
       'answer_16_ru': '<b>Вопрос №16/21</b>:\n' '<b>Страх смерти?</b>\n\n',

       'answer_16_uk': '<b>Запитання №16/21</b>:\n' '<b>Страх смерті?</b>\n\n',
              
       'answer_17_ru': '<b>Вопрос №17/21</b>:\n' '<b>Уязвимость, боязнь?</b>\n\n',

       'answer_17_uk': '<b>Запитання №17/21</b>:\n' '<b>Вразливість, страх?</b>\n\n',
              
       'answer_18_ru': '<b>Вопрос №18/21</b>:\n' '<b>Расстройство желудка или пищеварения?</b>\n\n',

       'answer_18_uk': '<b>Запитання №18/21</b>:\n' '<b>Розлад шлунка чи травлення?</b>\n\n',
              
       'answer_19_ru': '<b>Вопрос №19/21</b>:\n' '<b>Обмороки?</b>\n\n',

       'answer_19_uk': '<b>Запитання №19/21</b>:\n' '<b>Непритомність?</b>\n\n',
              
       'answer_20_ru': '<b>Вопрос №20/21</b>:\n' '<b>Покраснение лица?</b>\n\n',

       'answer_20_uk': '<b>Запитання №20/21</b>:\n' '<b>Почервоніння обличчя?</b>\n\n',
              
       'answer_21_ru': '<b>Вопрос №21/21</b>:\n' '<b>Потливость (не по причине перегрева)?</b>\n\n',

       'answer_21_uk':  '<b>Запитання №21/21</b>:\n' '▫<b>Пітливість (не через перегрівання)?</b>\n\n'}           
test_worry_beka_result = {'ru0-9': '<b>По результатам тестирования у тебя отсутствуют признаки тревоги</b> 😯\n\n'
                            ' .\n\n'
                            ' .\n\n'
                            ' <b>'
                            ' .</b>\n\n'
                            ' .',

                     'ru10-21': '<b>По результатам тестирования у тебя есть признаки незначительного уровня тревоги</b> 😯\n\n'
                            'Низкая тревожность. Отличная вещь! (если ты реалистичный человек в оценке ситуаций).\n\n'
                            'Слишком низкая тревога может указывать на то, оторванность от себя, других или своего окружения.\n\n'
                            
                            '<b>Стресс и тревожность часто сопутствуют друг другу. Если ты будешь есть, спать и делать то, что тебе нравится, у тебя будет больше сил выстоять против стресса и тревожности. '
                            'Другая важная часть хорошего самочувствия — осмелиться говорить «нет» и установить границы, в которых тебе комфортно.</b>\n\n',

                     'ru22-35': '<b>По результатам тестирования у тебя признаки средней выраженности тревоги</b> 😯\n\n'

                         '<i>❕ Ощущение напряжения или перепадов настроения.\n'
                            '❕ Беспокойство или раздражительность.\n'
                            '❕ Ожидание ухудшения ситуации и слежение за признаками опасности.\n'
                            '❕ Головная боль, постоянное чувство усталости и бессонница.</i>\n\n'
                     
                            'Всё это симптомы повышенной тревожности, которые негативно влияют на качество жизни. \n\n'
                            "<b>🔅 Испытывать тревогу — абсолютно нормально.</b> Это одно из базовых переживаний человека, которое к тому же необходимо для выживания. "
                            'Стресс и тревожность часто сопутствуют друг другу. Если ты будете есть, спать и делать то, что вам нравится, у тебя будет больше сил выстоять против стресса и тревожности.'
                            'Другая важная часть хорошего самочувствия — осмелиться говорить «нет» и установить границы, в которых тебе комфортно..\n\n'

                            '<i>Но когда тревога становится постоянной и чрезмерно повышенной, её нельзя оставлять без вмешательства специалистов. '
                            'Она редко проходит сама по себе. Но её можно лечить, и лечить вполне успешно.\n\n</i>'

                            '<b>Так-как не всегда есть возможность пойти к специалисту, можно в какой-то степени самому помочь себе: </b>\n\n'
                            "🔅 <b>Пытайся повышать свой порог испытываемой тревоги.</b> \n\n<i>Постепенно помещай себя в ситуации, которые вызывают дискомфорт. </i>"
                            "<b>Боишься публично выступать?</b><i> Сначала отпрепетируй речь на своих игрушках. Когда тревога от этого уменьшится, попробуй выступить"
                            "перед одним-двумя людьми которым ты доверяешь, и так, постепенно привыкая к раздражителю который вызывает тревогу, ты максимально снизишь свой уровень тревоги.</i>\n\n",
                            
                     'ru36-63': '<b>По результатам тестирования у тебя есть признаки очень сильной тревожности</b> 😯\n\n'
                            '<i>❕ Ощущение напряжения или перепадов настроения.\n'
                            '❕ Беспокойство или раздражительность.\n'
                            '❕ Ожидание ухудшения ситуации и слежение за признаками опасности.\n'
                            '❕ Головная боль, постоянное чувство усталости и бессонница.</i>\n\n'
                     
                            'Всё это симптомы повышенной тревожности, которые негативно влияют на качество жизни. \n\n'
                            "<b>🔅 Испытывать тревогу — абсолютно нормально.</b> Это одно из базовых переживаний человека, которое к тому же необходимо для выживания. "
                            "Тревожность — это реакция центральной нервной системы, которую вы не можете контролировать самостоятельно.\n\n"

                            '<i>Но когда тревога становится постоянной и чрезмерно повышенной, её нельзя оставлять без вмешательства специалистов. '
                            'Она редко проходит сама по себе. Но её можно лечить, и лечить вполне успешно.\n\n</i>'
                            "🔅 <b>Если ты постоянно чувствуешь тревогу и это мешает тебе жить полной жизнью, советую обратиться за помощью к профессиональному психологу или терапевту.</b>",
                     
                     'ru': '<b>Тест тревожности Бека - это опросник, который помогает оценить, насколько сильно ты тревожишься.</b>\n\n'
                            'Тест не даёт окончательного диагноза, но помогает понять, нужна ли тебе дополнительная помощь психолога.\n\n'
                            '<b>Внимательно изучите каждый вопрос и выберите тот вариант, который беспокоил вас на протяжении последней недели, включая день выполнения теста.</b>\n\n',

       '             uk': '<b>Тест тривожності Бека - це опитувальник, який допомагає оцінити, наскільки сильно ти турбуєшся.</b>\n\n'
                            'Тест не дає остаточного діагнозу, але допомагає зрозуміти, чи потрібна тобі додаткова допомога психолога.\n\n'
                            '<b>Уважно вивчіть кожне запитання та виберіть той варіант, який турбував вас протягом останнього тижня, включаючи день виконання тесту.</b>\n\n',

                     'uk0-9': '<b>За результатами тестування у тебе відсутні ознаки тривоги</b> 😯\n\n'
                            ' .\n\n'
                            ' .\n\n'
                            ' <b>'
                            ' .</b>\n\n'
                            ' .',

                     'uk10-21': '<b>За результатами тестування ти маєш ознаки незначного рівня тривоги</b> 😯\n\n'
                            ' .\n\n'
                            ' .\n\n'
                            ' <b>'
                            ' .</b>\n\n'
                            ' .',

                     'uk22-35': '<b>За результатами тестування ти маєш ознаки</b> 😯\n\n'
                            ' .\n\n'
                            ' .\n\n'
                            ' <b>'
                            ' .</b>\n\n'
                            ' .',
                            
                     'uk36-63': '<b>За результатами тестування ти маєш ознаки</b> 😯\n\n'
                            ' .\n\n'
                            ' .\n\n'
                            ' <b>'
                            ' .</b>\n\n'
                            ' .' }




duff = ['Пиздобратия мандопроушечная', 'Уёбище залупоглазое', 'Дрочепиздище хуеголовое', 'Пробиздоблядская мандопроушина',
        'Гнидопаскудная хуемандовина', 'Блядь ты семитаборная', 'Охуевшее блядепиздопроёбище', 'Хуй тебе в глотку через анальный проход',
        'Распизди тебя тройным перебором через вторичный переёб', 'Пиздоблятское хуепиздрическое мудовафлоебище сосущее километры трипперных членов',
        'Трихломидозопиздоеблохуеблядеперепиздическая спермоблевотина', 'Гондон с гонореей....',
        'Да разъебись ты троебучим проебом сперматоблятская пиздапроебина охуевающая в своей пидарастической сущности похожаю на ебущегося в жопу енота, сортирующего яйца в пизде кастрированной кобылы',
        'Хуелептический пиздопрозоид, еблоухий мандохвост', 'Ебун хуеголовый', 'Пидрасня ебаная', 'Залупоголовая блядоящерица', 'Трипиздоблядская промудохуина!',
        'Распроеб твою в крестище через коромысло в копейку мать', 'Что за блядская пиздопроебина, охуевающая своей пидорестической заебучестью невъебенной степени охуения.',
        'Заебись невъебенным проебом тримандоблядская пиздопроебина воспиздозаолупоклинившаяся в собственном злопиздии',
        'Что сидишь, как лунь пизду склевавший, мордоблядина залупоглазая. Ебись ты триебучим проебом пиздуй пока трамваи ходят, склипездень двужопостворчатый',
        'Злоебучее страхопиздище трипиздоблятский мандопроеб найвыебенищее распиздоблятство!', 'Застрявший в ебенгво гавнопрягопизд отпизднутый', 'Хуеблища и ебанагандонный хуепедераст',
        'Мудагавнопердь', 'Стоебучее страхопиздище охуевающее в собственной пидарастической злоебучести', 'Cемиголовый восьмихуй с четырьмя пиздопроебинами',
        'Облямудевшая страпиздихуюлина', 'Пидористический мудаблядин', 'Трипездоклятый мудопроеб', 'Промудохуеблядская пиздопроебина невьебенно охуевающая от своей собственной облядипизденелости',
        'Трипиздоблядское мудопроебное трипиздие', 'Ебоблядище охуевающее от собственной злоебучести', 'Облямуденный злоебучий страхопизднутый трихуемандаблядский ебаквакнутый',
        'Да разъебись ты триебучим проебом хуепуполо залупоглазое, промонодблядская трипиздыпроебина', 'Хуеблядская пиздопроебина',
        'Да разъебись ты тризлоебучим пробиздом тримандаблядская пиздопроушина охуевающая от собственного блядского невъебения!!', 'Высохший аналомокроблядник', 'Жирномногоканальный блядохероблядник',
        'Пизданутый попечитель мочалок', 'Толстомудый и плюшевый муфлон', 'Жирномногоканальный говноед']

name_sex = ['Александром', 'Сашей', 'Алексеем', 'Алиной', 'Анастасией', 'Анатолием', 'Анной', 'Арсеном', 'Богданом', 'Булатом', 'Вероникой',
            'Виктором', 'Викторией','Виталием','Владом','Геннадием', 'Давидом', 'Данилом', 'Дариной', 'Дарьей', 'Дениской', 'Димой', 'Женей', 'Егором',
            'Катей', 'Леной', 'Елизаветой', 'Ириной', 'Кариной', 'Максимом', 'Маратом', 'Марией', 'Милена','Мухаммедом', 'Надеждой', 'Никой', 'Оксаной',
            'Ольгой', 'Полиной', 'Райаном Гослингом', 'Маргаритой', 'Сергеем', 'Софией', 'Стасом', 'Татьяной', 'Яной', 'Денисом', 'cобой', 'никем', 'Cпартаком']

settings = {  'language_ru': 'Язык: Русский',
              'language_uk': 'Мова: Українська 🇺🇦', 
              'notice_1_ru': 'Уведомления: Вкл. 🔔', 
              'notice_0_ru': 'Уведомления: Выкл. 🔕',
              'notice_1_uk': 'Повідомлення: Вкл. 🔔',
              'notice_0_uk': 'Повідомлення: Викл. 🔕',
              'man_ru':      'Пол: Парень👨',
              'man_uk':      'Стать: Хлопець 👨',
              'woman_ru':    'Пол: Девушка 👩' ,
              'woman_uk':    'Стать: Дівчина 👩',
              'name_ru':     'Имя: ',
              'name_uk':     'Iм`я: '} 
             