start_sign_up = { # ПРИ СТАРТЕ И РЕГИСТРАЦИИ
                 'ru_bot_start':          '\nЯ твой бот-друг, можешь звать меня Панда 🐼.\n\nДавай сначала разберёмся как к тебе обращаться :)\n\n'
                                          'Нажимай кнопку ниже, чтобы выбрать язык, имя и пол:',

                 'uk_bot_start':          '\nЯ твій бот-друг, можеш звати мене Панда 🐼.\n\nДавай спочатку розберемось як до тебе звертатись :)\n\n'
                                          'Натискай кнопку нижче, щоб ввести мову, ім`я та стать:',

                 'en_bot_start':          "Sorry, but this bot does not support your language 😔.\nYou can choose one of the available:",

                 'ru_start_1/3':          '1/3: Выбери язык комфортный для тебя:',
                 'uk_start_1/3':          '1/3: Обери мову комфортну для тебе:',

                 'ru_start_2/3':          'Отлично!\n2/3: Как мне тебя называть? 🙂',
                 'uk_start_2/3':          'Чудово! \n2/3: Як мені тебе називати? 🙂',

                 'ru_start_too_long_name': 'Слишком длинное имя, давай покороче 😥',
                 'uk_start_too_long_name': 'Надто довге ім`я, давай більш коротко 😥',

                 'ru_start_3/3':          'Хорошо!\n3/3: Ты парень или девушка? 🚻',
                 'uk_start_3/3':          'Гаразд!\n3/3: Ти хлопець чи дівчина? 🚻',

                 'ru_dont_know_start':    'Извини, но я тебя не понимаю. 😔\nПожалуйста, выбери из предложенных:',
                 'uk_dont_know_start':    'Вибач, але я тебе не розумію. 😔\nБудь ласка, вибери iз запропонованих:',

                 'ru_again_bot_start':    'Приятно увидеть тебя снова :)',
                 'uk_again_bot_start':    'Приємно побачити тебе знову :)'}

reverse_info = {  # ПРИ ИЗМЕНЕНИИ ИНФОРМАЦИИ
                'ru_lang':         'Хорошо! Вы изменили язык на русский',
                'uk_lang':         'Добре! Ви змінили мову на українську.',

                'ru_gender':       'Хорошо! Вы поменяли пол',
                'uk_gender':       'Добре! Ви змінили стать',

                'ru_notice':       'Хорошо! Вы изменили уведомления',
                'uk_notice':       'Добре! Ви змінили повідомлення',

                'uk_name':         'Хорошо! Вы изменили имя',
                'ru_name':         'Добре! Ви змінили ім`я', }

general_text = {  # ОБЩИЕ ОТВЕТЫ И ШАБЛОНЫ
                'ru_list_tests':          'Вот cписок доступных тестов:',                  'ru_setting':        '<b>⚙️ Настройки: </b>',
                'uk_list_tests':          'Ось список доступних тестів:',                  'uk_setting':        '<b>⚙️ Налаштування: </b>',


                'ru_to_menu':             'Cупер! Перенаправляю тебя в меню. 🙂',          'ru_hello':          "Привет",    
                'uk_to_menu':             'Cупер! Перенаправляю тебе до меню. 🙂',         'uk_hello':          "Привiт",   

                'ru_dont_know_text':      'Я не знаю что тебе ответить :(',                'ru_send_ask':       'Твоё сообщение отправлено!',
                'uk_dont_know_text':      'Я не знаю що тобі відповісти :(',               'uk_send_ask':       'Твоє повідомлення відправлено!',


                'ru_empty_ask':           'Напиши свой вопрос, или просто накричи на Админа. Как хочешь 🙂',
                'uk_empty_ask':           'Напиши своє питання, чи просто накричи на Адміна. Як хочеш 🙂',

                'ru_help_menu':           'Here:\n/start - Старт, общий запуск\n/poh - Пнуть Админа\n/ask - Сообщение админу"\n/feedback - Прямая связь с автором',
                'uk_help_menu':           'Here:\n/start - Старт, загальний запуск\n/poh - Пнути Адмiна\n/ask - Повідомлення Aдмiну"\n/feedback - Прямий зв`язок з автором',

                "ru_set_name":            'Как мне тебя называть? 🙂',                     'ru_ask_admin_no':        'Хорошо, в другой раз! :)',
                "uk_set_name":            'Як мені до тебе звертатись? 🙂',                'uk_ask_admin_no':        'Добре, в інший раз! :)',


                'ru_menu_text':           '🔸                <b>Главное меню</b>                🔸\n\nЗдесь ты можешь пользоваться моими функциями.',
                'uk_menu_text':           '🔸                <b>Головне меню</b>                🔸\n\nТут ти можеш користуватися моїми функціями.',

                'ru_ask_admin_yes':       'Хорошо! Твое сообщение отправлено Админу :)',
                'uk_ask_admin_yes':       'Добре! Твоє повідомлення відправлено Адміну :)',


                'ru_feedback_yes':        'Говорят, через это меню можно поговорить с автором бота. Точно хочешь? 🙂',
                'uk_feedback_yes':        'Кажуть, через це меню можна поговорити з автором бота. Точно хочеш? 🙂',

                'ru_feedback_ok':         'Хорошо! Когда-нибудь с тобой свяжутся 😉 (или нет)\n    Ты можешь просто написать ему: @alexnerw',
                'uk_feedback_ok':         "Добре! Коли-небудь з тобою зв'яжуться 😉 (або ні)\n     Ти можеш просто написати йому: @alexnerw"}

test_depression_beka = {           # ТЕСТ ДЕПРЕССИИ БЕКА 
    
                        'answer_1_ru': '<b> ❔ Вопрос №1/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не испытываю печали\n\n'
                        '▫️ <b>2.</b> Я подавлен и печален\n\n'
                        '▫️ <b>3.</b> Я страдаю от тоски и подавленности\n\n'
                        '▫️ <b>4.</b> Я настолько несчастен, что я больше не могу этого выносить',

                        'answer_1_uk': '<b> ❔ Запитання №1/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не відчуваю смутку\n\n'
                        '▫️ <b>2.</b> Я пригнічений і сумний\n\n'
                        '▫️ <b>3.</b> Я страждаю від туги та пригніченості\n\n'
                        '▫️ <b>4.</b> Я настільки нещасний, що я більше не можу цього виносити',

                        'answer_2_ru': '<b> ❔ Вопрос №2/21</b>:\n\n'
                        '▫️ <b>1.</b> Будущее не подавляет и не пугает меня\n\n'
                        '▫️ <b>2.</b> Будущее меня пугает\n\n'
                        '▫️ <b>3.</b> Я чувствую, что будущее совсем ничего не может мне предложить\n\n'
                        '▫️ <b>4.</b> Я чувствую, что будущее безнадежно, и не могу поверить, что что-то изменится в лучшую сторону',

                        'answer_2_uk': '<b> ❔ Запитання №2/21</b>:\n\n'
                        '▫️ <b>1.</b> Майбутнє не пригнічує і не лякає мене\n\n'
                        '▫️ <b>2.</b> Майбутнє мене лякає\n\n'
                        '▫️ <b>3.</b> Я відчуваю, що майбутнє зовсім нічого не може мені запропонувати\n\n'
                        '▫️ <b>4.</b> Я відчуваю, що майбутнє безнадійне, і не можу повірити, що щось зміниться на краще',

                        'answer_3_ru': '<b> ❔ Вопрос №3/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не чувствую себя неудачником\n\n'
                        '▫️ <b>2.</b> Я чувствую, что неудачлив больше, чем другие\n\n'
                        '▫️ <b>3.</b> В прошлом я вижу лишь серию неудач\n\n'
                        '▫️ <b>4.</b> Я ощущаю себя полным неудачником',

                        'answer_3_uk': '<b> ❔ Запитання №3/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не почуваюся невдахою\n\n'
                        '▫️ <b>2.</b> Я відчуваю, що невдачливий більше, ніж інші\n\n'
                        '▫️ <b>3.</b> У минулому я бачу лише серію невдач\n\n'
                        '▫️ <b>4.</b> Я відчуваю себе повним невдахою',

                        'answer_4_ru': '<b> ❔ Вопрос №4/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не испытываю безразличия\n\n'
                        '▫️ <b>2.</b> Вещи и события не радуют меня, как раньше\n\n'
                        '▫️ <b>3.</b> Мне кажется, что я вообще ни от чего не получаю удовлетворения\n\n'
                        '▫️ <b>4.</b> Я ничего не хочу и всем недоволен',

                        'answer_4_uk': '<b> ❔ Запитання №4/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не відчуваю байдужості\n\n'
                        '▫️ <b>2.</b> Речі та події не радують мене, як раніше\n\n'
                        '▫️ <b>3.</b> Мені здається, що я взагалі ні від чого не отримую задоволення\n\n'
                        '▫️ <b>4.</b> Я нічого не хочу і всім незадоволений',

                        'answer_5_ru': '<b> ❔ Вопрос №5/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не чувствую никакой вины за собой\n\n'
                        '▫️ <b>2.</b> Я чувствую себя плохим и никчемным человеком\n\n'
                        '▫️ <b>3.</b> Я чувствую себя плохим и никчемным практически всегда\n\n'
                        '▫️ <b>4.</b> Я чувствую себя очень плохим и ненужным',

                        'answer_5_uk': '<b> ❔ Запитання №5/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не відчуваю жодної провини за собою\n\n'
                        '▫️ <b>2.</b> Я почуваюся поганою і нікчемною людиною\n\n'
                        '▫️ <b>3.</b> Я відчуваю себе поганим і нікчемним практично завжди\n\n'
                        '▫️ <b>4.</b> Я почуваюся дуже поганим та непотрібним',

                        'answer_6_ru': '<b> ❔ Вопрос №6/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не думаю, что меня накажут\n\n'
                        '▫️ <b>2.</b> Я чувствую, что со мной может случиться что-то плохое\n\n'
                        '▫️ <b>3.</b> Я верю, что меня судьба меня накажет\n\n'
                        '▫️ <b>4.</b> Я знаю, что я совершал такие поступки, за которые меня следует наказать',

                        'answer_6_uk': '<b> ❔ Запитання №6/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не думаю, що мене покарають\n\n'
                        '▫️ <b>2.</b> Я відчуваю, що зі мною може статися щось погане\n\n'
                        '▫️ <b>3.</b> Я вірю, що мене доля мене покарає\n\n'
                        '▫️ <b>4.</b> Я знаю, що я робив такі вчинки, за які мене слід покарати',

                        'answer_7_ru': '<b> ❔ Вопрос №7/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не разочарован в себе\n\n'
                        '▫️ <b>2.</b> Я разочарован в себе\n\n'
                        '▫️ <b>3.</b> Я зол на себя\n\n'
                        '▫️ <b>4.</b> Я ненавижу себя',

                        'answer_7_uk': '<b> ❔ Запитання №7/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не розчарований у собі\n\n'
                        '▫️ <b>2.</b> Я розчарований у собі\n\n'
                        '▫️ <b>3.</b> Я злий на себе\n\n'
                        '▫️ <b>4.</b> Я ненавиджу себе',

                        'answer_8_ru': '<b> ❔ Вопрос №8/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не считаю себя хуже других\n\n'
                        '▫️ <b>2.</b> Я критикую свои слабости\n\n'
                        '▫️ <b>3.</b> Я виню себя за ошибки\n\n'
                        '▫️ <b>4.</b> Я виню себя за все, что идет не так',

                        'answer_8_uk': '<b> ❔ Запитання №8/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не вважаю себе гірше за інших\n\n'
                        '▫️ <b>2.</b> Я критикую свої слабкості\n\n'
                        '▫️ <b>3.</b> Я звинувачую себе за помилки\n\n'
                        '▫️ <b>4.</b> Я звинувачую себе за все, що йде не так',

                        'answer_9_ru': '<b> ❔ Вопрос №9/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не думаю о том, чтобы нанести себе вред\n\n'
                        '▫️ <b>2.</b> Я иногда думаю покончить с собой, но я не буду этого делать\n\n'
                        '▫️ <b>3.</b> Я реально думаю о самоубийстве\n\n'
                        '▫️ <b>4.</b> Я убью себя, как только представится возможность',

                        'answer_9_uk': '<b> ❔ Запитання №9/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не думаю про те, щоб завдати собі шкоди\n\n'
                        '▫️ <b>2.</b> Я іноді думаю накласти на себе руки, але я не робитиму цього\n\n'
                        '▫️ <b>3.</b> Я реально думаю про самогубство\n\n'
                        '▫️ <b>4.</b> Я вб`ю себе, як тільки з`явиться можливість',

                        'answer_10_ru': '<b> ❔ Вопрос №10/21</b>:\n\n'
                        '▫️ <b>1.</b> Я плачу не чаще обычного\n\n'
                        '▫️ <b>2.</b> Сейчас я плачу чаще, чем обычно\n\n'
                        '▫️ <b>3.</b> Я все время плачу\n\n'
                        '▫️ <b>4.</b> Я не могу заплакать, даже когда я хочу',

                        'answer_10_uk': '<b> ❔ Запитання №10/21</b>:\n\n'
                        '▫️ <b>1.</b> Я плачу не частіше, ніж звичайно\n\n'
                        '▫️ <b>2.</b> Зараз я плачу частіше, ніж зазвичай\n\n'
                        '▫️ <b>3.</b> Я весь час плачу\n\n'
                        '▫️ <b>4.</b> Я не можу заплакати, навіть коли я хочу',

                        'answer_11_ru': '<b> ❔ Вопрос №11/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не более раздражен, чем обычно\n\n'
                        '▫️ <b>2.</b> Я раздражаюсь легче, чем обычно\n\n'
                        '▫️ <b>3.</b> Я все время раздражен\n\n'
                        '▫️ <b>4.</b> Меня уже не задевают те вещи, которые раньше раздражали',

                        'answer_11_uk': '<b> ❔ Запитання №11/21</b>:\n\n'
                        '▫️ <b>1.</b> Я не більше роздратований, ніж зазвичай\n\n'
                        '▫️ <b>2.</b> Я дратуюсь легше, ніж зазвичай\n\n'
                        '▫️ <b>3.</b> Я весь час роздратований\n\n'
                        '▫️ <b>4.</b> Мене вже не зачіпають ті речі, які раніше дратували',

                        'answer_12_ru': '<b> ❔ Вопрос №12/21</b>:\n\n'
                        '▫️ <b>1.</b> Люди интересны мне по-прежнему\n\n'
                        '▫️ <b>2.</b> Другие люди интересуют меня меньше прежнего\n\n'
                        '▫️ <b>3.</b> Я почти утратил интерес и чувства к другим людям\n\n'
                        '▫️ <b>4.</b> Я полностью утратил интерес к людям и не обращаю на них внимания',

                        'answer_12_uk': '<b> ❔ Запитання №12/21</b>:\n\n'
                        '▫️ <b>1.</b> Люди цікаві мені як і раніше\n\n'
                        '▫️ <b>2.</b> Інші люди цікавлять мене менше за колишнє\n\n'
                        '▫️ <b>3.</b> Я майже втратив інтерес та почуття до інших людей\n\n'
                        '▫️ <b>4.</b> Я повністю втратив інтерес до людей і не звертаю на них уваги',

                        'answer_13_ru': '<b> ❔ Вопрос №13/21</b>:\n\n'
                        '▫️ <b>1.</b> Я способен принимать решения, как и прежде\n\n'
                        '▫️ <b>2.</b> Я стараюсь избегать принятия решений\n\n'
                        '▫️ <b>3.</b> Мне очень трудно принимать решения\n\n'
                        '▫️ <b>4.</b> Я больше вообще не могу принимать решения',

                        'answer_13_uk': '<b> ❔ Запитання №13/21</b>:\n\n'
                        '▫️ <b>1.</b> Я здатний приймати рішення, як і раніше\n\n'
                        '▫️ <b>2.</b> Я намагаюся уникати прийняття рішень\n\n'
                        '▫️ <b>3.</b> Мені дуже важко приймати рішення\n\n'
                        '▫️ <b>4.</b> Я більше взагалі не можу приймати рішення',

                        'answer_14_ru': '<b> ❔ Вопрос №14/21</b>:\n\n'
                        '▫️ <b>1.</b> По-моему, мой внешний вид не изменился\n\n'
                        '▫️ <b>2.</b> Я обеспокоен тем, что выгляжу постаревшим и непривлекательным\n\n'
                        '▫️ <b>3.</b> По-моему, мой внешний вид полностью изменился и я не выгляжу больше привлекательным\n\n'
                        '▫️ <b>4.</b> Я чувствую себя страшным и отталкивающим',

                        'answer_14_uk': '<b> ❔ Запитання №14/21</b>:\n\n'
                        '▫️ <b>1.</b> На мою думку, мій зовнішній вигляд не змінився\n\n'
                        '▫️ <b>2.</b> Я стурбований тим, що виглядаю старим і непривабливим\n\n'
                        '▫️ <b>3.</b> На мою думку, мій зовнішній вигляд повністю змінився і я не виглядаю більш привабливим\n\n'
                        '▫️ <b>4.</b> Я відчуваю себе страшним і відразливим',

                        'answer_15_ru': '<b> ❔ Вопрос №15/21</b>:\n\n'
                        '▫️ <b>1.</b> Моя работоспособность сохранилась на прежнем уровне\n\n'
                        '▫️ <b>2.</b> Начало работы требует от меня дополнительных усилий\n\n'
                        '▫️ <b>3.</b> Чтобы что-то сделать вовремя, мне нужно буквально заставлять себя\n\n'
                        '▫️ <b>4.</b> Я совсем не могу работать',

                        'answer_15_uk': '<b> ❔ Запитання №15/21</b>:\n\n'
                        '▫️ <b>1.</b> Моя працездатність збереглася на колишньому рівні\n\n'
                        '▫️ <b>2.</b> Початок роботи вимагає від мене додаткових зусиль\n\n'
                        '▫️ <b>3.</b> Щоб щось зробити вчасно, мені потрібно буквально примушувати себе\n\n'
                        '▫️ <b>4.</b> Я зовсім не можу працювати',

                        'answer_16_ru': '<b> ❔ Вопрос №16/21</b>:\n\n'
                        '▫️ <b>1.</b> Я сплю так же хорошо, как обычно\n\n'
                        '▫️ <b>2.</b> По утрам я чувствую себя более усталым, чем раньше\n\n'
                        '▫️ <b>3.</b> Я просыпаюсь на 2-3 часа раньше обычного и больше не могу уснуть\n\n'
                        '▫️ <b>4.</b> Я просыпаюсь раньше обычного каждое утро и не могу проспать подряд более 5 часов',

                        'answer_16_uk': '<b> ❔ Запитання №16/21</b>:\n\n'
                        '▫️ <b>1.</b> Я сплю так само добре, як завжди\n\n'
                        '▫️ <b>2.</b> Вранці я почуваюся більш стомленим, ніж раніше\n\n'
                        '▫️ <b>3.</b> Я прокидаюся на 2-3 години раніше, ніж звичайно, і більше не можу заснути\n\n'
                        '▫️ <b>4.</b> Я прокидаюся раніше, ніж звичайно, щоранку і не можу проспати поспіль більше 5 годин',

                        'answer_17_ru': '<b> ❔ Вопрос №17/21</b>:\n\n'
                        '▫️ <b>1.</b> Я устаю не больше обычного\n\n'
                        '▫️ <b>2.</b> Я устаю быстрее, чем раньше\n\n'
                        '▫️ <b>3.</b> Я устаю буквально на пустом месте\n\n'
                        '▫️ <b>4.</b> Я настолько устал, что не могу ничего делать',

                        'answer_17_uk': '<b> ❔ Запитання №17/21</b>:\n\n'
                        '▫️ <b>1.</b> Я втомлююся не більше звичайного\n\n'
                        '▫️ <b>2.</b> Я втомлююся швидше, ніж раніше\n\n'
                        '▫️ <b>3.</b> Я втомлююся буквально на порожньому місці\n\n'
                        '▫️ <b>4.</b> Я настільки втомився, що не можу нічого робити',

                        'answer_18_ru': '<b> ❔ Вопрос №18/21</b>:\n\n'
                        '▫️ <b>1.</b> Мой аппетит такой же, как и прежде\n\n'
                        '▫️ <b>2.</b> Мой аппетит слабее, чем прежде\n\n'
                        '▫️ <b>3.</b> Мой аппетит сильно ухудшился\n\n'
                        '▫️ <b>4.</b> У меня вообще нет аппетита',

                        'answer_18_uk': '<b> ❔ Запитання №18/21</b>:\n\n'
                        '▫️ <b>1.</b> Мій апетит такий самий, як і раніше\n\n'
                        '▫️ <b>2.</b> Мій апетит слабший, ніж раніше\n\n'
                        '▫️ <b>3.</b> Мій апетит сильно погіршився\n\n'
                        '▫️ <b>4.</b> У мене взагалі немає апетиту',

                        'answer_19_ru': '<b> ❔ Вопрос №19/21</b>:\n\n'
                        '▫️ <b>1.</b> Мой вес в последнее время сохранился на прежнем уровне\n\n'
                        '▫️ <b>2.</b> Я похудел больше, чем на 3 кг\n\n'
                        '▫️ <b>3.</b> Я похудел больше, чем на 5 кг\n\n'
                        '▫️ <b>4.</b> Я похудел больше, чем на 8 кг',

                        'answer_19_uk': '<b> ❔ Запитання №19/21</b>:\n\n'
                        '▫️ <b>1.</b> Моя вага останнім часом збереглася на колишньому рівні\n\n'
                        '▫️ <b>2.</b> Я схуд більше, ніж на 3 кг\n\n'
                        '▫️ <b>3.</b> Я схуд більше, ніж на 5 кг\n\n'
                        '▫️ <b>4.</b> Я схуд більше, ніж на 8 кг',

                        'answer_20_ru': '<b> ❔ Вопрос №20/21</b>:\n\n'
                        '▫️ <b>1.</b> Я думаю о своем здоровье не чаще, чем обычно\n\n'
                        '▫️ <b>2.</b> Я все чаще замечаю разные боли и недомогания, расстройства желудка и запоры\n\n'
                        '▫️ <b>3.</b> Я настолько внимательно слежу за тем, что чувствую и как я себя чувствую, что не могу думать ни о чем другом\n\n'
                        '▫️ <b>4.</b> Я полностью погружен в мысли о своем здоровье и ощущениях',

                        'answer_20_uk': '<b> ❔ Запитання №20/21</b>:\n\n'
                        '▫️ <b>1.</b> Я думаю про своє здоров`я не частіше, ніж зазвичай\n\n'
                        '▫️ <b>2.</b> Я все частіше помічаю різні болі та нездужання, розлади шлунка та запори\n\n'
                        '▫️ <b>3.</b> Я настільки уважно стежу за тим, що відчуваю і як я почуваюся, що не можу думати ні про що інше\n\n'
                        '▫️ <b>4.</b> Я повністю занурений у думки про своє здоров`я та відчуття',

                        'answer_21_ru': '<b> ❔ Вопрос №21/21</b>:\n\n'
                        '▫️ <b>1.</b> Мой интерес к половой жизни не изменился\n\n'
                        '▫️ <b>2.</b> Мой интерес к половой жизни снизился\n\n'
                        '▫️ <b>3.</b> Мой интерес к половой жизни значительно снизился\n\n'
                        '▫️ <b>4.</b> Я полностью потерял интерес к половой жизни',

                        'answer_21_uk':  '<b> ❔ Запитання №21/21</b>:\n\n'
                        '▫️ <b>1.</b> Мій інтерес до статевого життя не змінився\n\n'
                        '▫️ <b>2.</b> Мій інтерес до статевого життя знизився\n\n'
                        '▫️ <b>3.</b> Мій інтерес до статевого життя значно знизився\n\n'
                        '▫️ <b>4.</b> Я повністю втратив інтерес до статевого життя'
}
test_depression_beka_result = {    #     РЕЗУЛЬТАТ   
       'ru0-9':      '<b>По результатам тестирования у тебя отсутствуют симптомы депрессии. </b>😌\n\n'

                     'Твоё психоэмоциональное состояние в норме и не вызывает никаких опасений.\n\n'

                     'Общайся, слушай музыку, занимайся спортом, употребляй нужные организму витамины, делай всё что тебя радует и скорее всего депрессия никогда тебя не застанет 😎\n\n'

                     "Но, к сожалению, не всем удаётся так оптимистично оценивать свою жизнь. Если ты заметишь у кто-то из твоего "
                     "круга общения постоянное чувство тоски, снижение интереса к жизни, вялость или суицидальные мысли, вот несколько советов:\n\n"

                     " 🔅<b> Слушай и поддерживай</b>: <i>Позволь человеку выразить свои чувства и переживания. Слушай его внимательно, без прерываний и суждений. "
                     "Не суди, не критику и не дави на него. Попробуй вместе выявить причины депрессии.</i>\n\n"

                     " 🔅<b> Организуй досуг и поощряй здоровый образ жизни</b>: <i>Предложи заняться совместными увлечениями, пойти в кино, на концерт или прогуляться по парку. "
                     "Поощри здоровый образ жизни, включая физические упражнения, здоровое питание и достаточный сон.</i>\n\n"

                     " 🔅<b> Направь к специалисту</b>: <i>Помни, что если состояние человека не улучшается, ему может потребоваться помощь психолога или психотепевта. "
                     " Направь его к профессионалу и помоги найти подходящего специалиста.</i>",

       'ru10-15':    '<b>По результатам тестирования у тебя есть признаки легкой депрессии (субдепрессии). </b>😯\n\n'

                     'Но следует уметь принимать <i>«дождливое»</i> настроение и незачеты судьбы и знать: плохое настроеное – ещё далеко не депрессия.\n\n'

                     'При лёгкой депрессии, ты обычно можешь справляться с повседневной жизнью, даже если тебе плохо.\n\n'

                     ' 🔅 Поговорить с кем-нибудь, заняться спортом или слушать музыку может помочь почувствовать себя лучше или, по крайней мере, не так плохо.\n\n'

                     '<b>Также очень важно давать себе высыпаться, есть важные для организма витамины и находиться на солнце, это стимулирует выработку '
                     '"гормона радости" и улучшает самочувствие.</b>\n\n'

                     ' 🔅 Не стоит думать что депрессия просто плохое настроение которое пройдёт со временем.\n\n'

                     'Обычно она легко проходит, когда человек решает проблему с помощью психотерапевта. 🙂',

       'ru16-19':    '<b>По результатам тестирования у тебя есть симптомы умеренной депрессии. 😯</b>\n\n'

                     'Депрессия на данном этапе создает определенные трудности для нормальной жизни и опасна быстрым переходом на следующую стадию.\n\n'

                     ' 🔅 Поговорить с кем-нибудь, заняться спортом или слушать музыку может помочь почувствовать себя лучше или, по крайней мере, не так плохо.\n\n'

                     '<b>Также очень важно давать себе высыпаться, есть важные для организма витамины и находиться на солнце, это стимулирует выработку '
                     '"гормона радости" и улучшает твоё самочувствие.</b>\n\n'

                     ' 🔅 На сегодняшний день депрессия является одной из самых распространенных причин больничных.\n\n'

                     "<b>Если твоё состояние не улучшается, не стесняйся обратиться за помощью к психологу или психотерапевту. "
                     "Они могут помочь разобраться с причинами, и найти способы решения проблем.</b>",

       'ru20-29':    '<b>По результатам тестирования у тебя есть признаки выраженной депрессии (средней тяжести). </b>😯\n\n'

                     'Депрессия на этой стадии создает преграды для нормальной жизни и легко может перейти в тяжелую депрессию. \n\n'

                     " 🔅 <b>Депрессия — это Болезнь.</b>\n"
                     "<i>Такая же, как, например, диабет. Это серьезное заболевание, и оно ограничивает наши возможности, сужает наш мир, отнимает силы. "
                     "Если у тебя сломана нога — ты не ругаешь себя за то, что не можешь встать. Не считаешь себя слабым, безвольным, ничтожным. "
                     "<b>Но депрессия — это как две сломанные ноги, она ломает то, что заставляло их ходить, отдавало им приказы — твой мозг</b></i>.\n\n"

                     " 🔅 <b>Важно понять, что это - болезнь. А не твой выбор. И не твоя вина.</b> \n"
                     "<i>Депрессия — это не Ты. А Ты - это не твоя Депрессия. Часто мы сливаемся с депрессией, считаем её нашей частью. \n"
                     "Сначала — частью, потом депрессия вытесняет все. И пока ты отождествляешь себя с ней, тебе будет крайне сложно вытащить себя из депрессии.</i>\n\n"

                     '<b>Поговорить с кем-нибудь, заняться спортом или слушать музыку может помочь почувствовать себя лучше или, по крайней мере, не так плохо.\n'
                     'Важно давать себе высыпаться, есть важные для организма витамины и находиться на солнце, это стимулирует выработку '
                     '"гормона радости" и улучшает твоё самочувствие.</b>\n\n'

                     "<b>Если твоё состояние не улучшается, не стесняйся обратиться за помощью к психологу или психотерапевту. "
                     "Они могут помочь разобраться с причинами, и найти способы решения проблем.</b>",

       'ru30-63':    '<b>По результатам тестирования у тебя есть симптомы тяжелой депрессии. </b>😯\n\n'
                     
                     " 🔅 <b>Депрессия — это Болезнь.</b>\n"
                     "<i>Такая же, как, например, диабет. Это серьезное заболевание, и оно ограничивает наши возможности, сужает наш мир, отнимает силы. "
                     "Если у тебя сломана нога — ты не ругаешь себя за то, что не можешь встать. Не считаешь себя слабым, безвольным, ничтожным. "
                     "<b>Но депрессия — это как две сломанные ноги, она ломает то, что заставляло их ходить, отдавало им приказы — твой мозг</b></i>.\n\n"

                     " 🔅 <b>Важно понять, что это - болезнь. А не твой выбор. И не твоя вина.</b> \n"
                     "<i>Депрессия — это не Ты. А Ты - это не твоя Депрессия. Часто мы сливаемся с депрессией, считаем её нашей частью. \n"
                     "Сначала — частью, потом депрессия вытесняет все. И пока ты отождествляешь себя с ней, тебе будет крайне сложно вытащить себя из депрессии.</i>\n\n"

                     " 🔅 Выход из депрессии это не гонка. Не нужно оправдываться и чувствовать себя виноватыми. Не нужно тратить на это силы — всё это лишь углубляет депрессию.\n\n"

                     "<b>Если твоё состояние не улучшается, не стесняйся обратиться за помощью к психологу или психотерапевту. "
                     "Они могут помочь разобраться с причинами, и найти способы решения проблем.</b>",

       'ru':         "Многие используют слово \"депрессия\" для того, чтобы описать плохое настроение, печаль или просто, чтобы сказать, что они не в духе. \n\n"

                     "Следует помнить, что депрессия - не просто плохое настроение, а заболевание, которое требует вмешательства специалистов и достаточно хорошо поддается лечению.\n\n"

                     "<i>❗️ Не следует после его прохождения и получения результатов заниматься самолечением. "
                     "Результаты и интерпретации, полученные без участия специалистов, не следует воспринимать слишком серьезно.</i> \n\n"
                     "<b>Тест стоит пройти даже тем, кто абсолютно уверен, что здоров. Некоторые утверждения из опросника могут показаться странными, но многие из них справедливы для человека с заболеванием.</b>\n\n"

                     "Так что если ты считаешь, будто депрессия — это когда кто-то приуныл от безделья, пора переосмыслить своё отношение.",

       'uk':         "Багато хто використовує слово \"депресія\" для того, щоб описати поганий настрій, смуток або просто, щоб сказати, що вони не в дусі. \n\n"

                     "Слід пам'ятати, що депресія - не просто поганий настрій, а захворювання, яке вимагає втручання фахівців та досить добре піддається лікуванню. \n\n"

                     "<i>❗️ Не варто після його проходження та отримання результатів займатися самолікуванням. "
                     "Результати та інтерпретації, отримані без участі фахівців, не слід сприймати надто серйозно.</i> \n\n"
                     "<b>Тест варто пройти навіть тим, хто абсолютно впевнений, що здоровий. Деякі твердження з опитувальника можуть бути дивними, але багато з них справедливі для людини із захворюванням.</b>\n\n"

                     "Отже якщо ти вважаєш, ніби депресія - це коли хтось зажурився від неробства, настав час переосмислити своє ставлення.",

       'uk0-9':      '<b>За результатами тестування у тебе відсутні симптоми депресії. </b>😌\n\n'

                     'Твій психоемоційний стан у нормі і не викликає жодних побоювань.\n\n'

                     'Спілкуйся, слухай музику, займайся спортом, вживай потрібні організму вітаміни, роби все, що тебе радує і швидше за все депресія ніколи тебе не застане 😎\n\n'

                     "Але, на жаль, не всім вдається так оптимістично оцінювати своє життя. Якщо ти помітиш у когось із твого "
                     "кола спілкування постійне почуття туги, зниження інтересу до життя, млявість або суїцидальні думки, ось кілька порад:\n\n"

                     " 🔅<b> Слухай та підтримуй</b>: <i>Дозволь людині висловити свої почуття та переживання. Слухай її уважно, без переривань і суджень. "
                     "Не суди, не критику і не тисни на нього. Спробуй разом виявити причини депресії.</i>\n\n"

                     " 🔅<b> Організуй дозвілля і заохочуй здоровий спосіб життя</b>: <i>Запропонуй зайнятися спільними захопленнями, піти в кіно, на концерт або прогулятися парком. "
                     "Заохочуй здоровий спосіб життя, включаючи фізичні вправи, здорове харчування та достатній сон.</i>\n\n"

                     "🔅<b> Направ до фахівця</b>: <i>Пам'ятай, що якщо стан людини не покращується, йому може знадобитися допомога психолога або психотерапевта. "
                     "Направ його до професіонала та допоможи знайти відповідного фахівця.</i>",

       'uk10-15':    '<b>За результатами тестування у тебе є ознаки легкої депресії (субдепресії). </b>😯\n\n'

                     'Але слід уміти приймати <i>«дощовий»</i> настрій і незаліки долі і знати: поганий настрій – ще далеко не депресія.\n\n'

                     'При легкій депресії, ти зазвичай можеш справлятися з повсякденним життям, навіть якщо тобі погано.\n\n'

                     ' 🔅 Поговорити з кимось, зайнятися спортом або слухати музику може допомогти відчути себе краще або, принаймні, не так погано.\n\n'

                     '<b>Також дуже важливо давати собі висипатися, є важливі для організму вітаміни і перебувати на сонці, це стимулює вироблення '
                     '"гормону радості" та покращує самопочуття.</b>\n\n'

                     ' 🔅 Не варто думати, що депресія просто поганий настрій, який пройде з часом.\n\n'

                     'Зазвичай вона легко проходить, коли людина вирішує проблему за допомогою психотерапевта. 🙂',

       'uk16-19':    '<b>За результатами тестування у тебе є симптоми помірної депресії. 😯</b>\n\n'

                     'Депресія на даному етапі створює певні труднощі для нормального життя і небезпечна швидким переходом на наступну стадію.\n\n'

                     ' 🔅 Поговорити з кимось, зайнятися спортом або слухати музику може допомогти відчути себе краще або, принаймні, не так погано.\n\n'

                     '<b>Також дуже важливо давати собі висипатися, є важливі для організму вітаміни і перебувати на сонці, це стимулює вироблення '
                     '"гормону радості" і покращує твоє самопочуття.</b>\n\n'

                     ' 🔅 На сьогоднішній день депресія є однією з найпоширеніших причин лікарняних.\n\n'

                     "<b>Якщо твій стан не покращується, не соромся звернутися за допомогою до психолога або психотерапевта. "
                     "Вони можуть допомогти розібратися з причинами і знайти способи вирішення проблем.</b>",

       'uk20-29': '<b>За результатами тестування у тебе є ознаки вираженої депресії (середньої тяжкості). </b>😯\n\n'

                     "Депресія на цій стадії створює перепони для нормального життя і легко може перейти у тяжку депресію. \n\n"

                     " 🔅 <b>Депресія - це Хвороба.</b>\n"
                     "Така ж, як, наприклад, діабет.<i> Це серйозне захворювання, і воно обмежує наші можливості, звужує наш світ, забирає сили. "
                     "Якщо в тебе зламана нога - ти не лаєш себе за те, що не можеш встати. Не вважаєш себе слабким, безвільним, нікчемним. "
                     "<b>Але депресія - це як дві зламані ноги, вона ламає те, що змушувало їх ходити, віддавало їм накази - твій мозок</b></i>.\n\n"

                     " 🔅 <b>Важливо зрозуміти, що це - хвороба. А не твій вибір. І не твоя вина.</b> \n"
                     "<i>Депресія - це не Ти. А Ти - це не твоя Депресія. Часто ми зливаємося з депресією, вважаємо її нашою частиною. \n"
                     "Спочатку - частиною, потім депресія витісняє все. І поки ти ототожнюєш себе з нею, тобі буде вкрай складно витягти себе з депресії.</i>\n\n"

                     "<b>Поговорити з кимось, зайнятися спортом або слухати музику може допомогти відчути себе краще або, принаймні, не так погано.\n"
                     'Важливо давати собі висипатися, є важливі для організму вітаміни і перебувати на сонці, це стимулює вироблення '
                     '"гормону радості" і покращує твоє самопочуття.</b>\n\n'

                     "<b>Якщо твій стан не покращується, не соромся звернутися за допомогою до психолога або психотерапевта. " 
                     "Вони можуть допомогти розібратися з причинами і знайти способи вирішення проблем.</b>",

       'uk30-63': '<b>За результатами тестування у тебе є симптоми тяжкої депресії. </b>😯\n\n'
                     
                     " 🔅 <b>Депресія - це Хвороба.</b>\n"
                     "Така ж, як, наприклад, діабет.<i> Це серйозне захворювання, і воно обмежує наші можливості, звужує наш світ, забирає сили. "
                     "Якщо в тебе зламана нога - ти не лаєш себе за те, що не можеш встати. Не вважаєш себе слабким, безвільним, нікчемним. "
                     "<b>Але депресія - це як дві зламані ноги, вона ламає те, що змушувало їх ходити, віддавало їм накази - твій мозок</b></i>.\n\n"

                     " 🔅 <b>Важливо зрозуміти, що це - хвороба. А не твій вибір. І не твоя вина.</b> \n"
                     "<i>Депресія - це не Ти. А Ти - це не твоя Депресія. Часто ми зливаємося з депресією, вважаємо її нашою частиною. \n"
                     "Спочатку - частиною, потім депресія витісняє все. І поки ти ототожнюєш себе з нею, тобі буде вкрай складно витягти себе з депресії.</i>\n\n"

                     "🔅 Вихід з депресії це не гонка. Не потрібно виправдовуватися і відчувати себе винними. Не потрібно витрачати на це сили - все це лише поглиблює депресію.\n\n"

                     "<b>Якщо твій стан не покращується, не соромся звернутися за допомогою до психолога або психотерапевта. "
                     "Вони можуть допомогти розібратися з причинами і знайти способи вирішення проблем.</b>"}

test_worry_beka = {                # ТЕСТ ТРЕВОЖНОСТИ БЕКА 
    'answer_start_ru': "Насколько сильно Вас беспокоило данное ощущение за последнюю неделю:\n\n",
    'answer_start_uk': "Наскільки сильно Вас турбувало це відчуття за останній тиждень:\n\n",

    'answer_1_ru': '❔ Вопрос №1/21:\n' '<b>Ощущение онемения или покалывания в теле?</b>\n\n',
    'answer_1_uk': '❔ Запитання №1/21:\n' '<b>Відчуття оніміння або поколювання в тілі?</b>\n\n',

    'answer_2_ru': '❔ Вопрос №2/21:\n' '<b>Ощущение жара?</b>\n\n',
    'answer_2_uk': '❔ Запитання №2/21:\n' '<b>Відчуття жару?</b>\n\n',

    'answer_3_ru': '❔ Вопрос №3/21:\n' '<b>Слабость в коленях/ногах?</b>\n\n',
    'answer_3_uk': '❔ Запитання №3/21:\n' '<b>Слабкість у колінах/ногах?</b>\n\n',

    'answer_4_ru': '❔ Вопрос №4/21:\n' '<b>Невозможность расслабиться?</b>\n\n',
    'answer_4_uk': '❔ Запитання №4/21:\n' '<b>Неможливість розслабитись?</b>\n\n',

    'answer_5_ru': '❔ Вопрос №5/21:\n' '<b>Страх, что произойдет самое плохое?</b>\n\n',
    'answer_5_uk': '❔ Запитання №5/21:\n' '<b>Страх, що станеться найгірше?</b>\n\n',

    'answer_6_ru': '❔ Вопрос №6/21:\n' '<b>Головокружение или ощущение легкости в голове?</b> \n\n',
    'answer_6_uk': '❔ Запитання №6/21:\n' '<b>Запаморочення чи відчуття легкості в голові?</b> \n\n',

    'answer_7_ru': '❔ Вопрос №7/21:\n' '<b>Учащенное сердцебиение?</b> \n\n',
    'answer_7_uk': '❔ Запитання №7/21:\n' '<b>Прискорене серцебиття?</b> \n\n',

    'answer_8_ru': '❔ Вопрос №8/21:\n' '<b>Пошатывание?</b> \n\n',
    'answer_8_uk': '❔ Запитання №8/21:\n' '<b>Похитування?</b> \n\n',

    'answer_9_ru': '❔ Вопрос №9/21:\n' '<b>Ужас или страх?</b> \n\n',
    'answer_9_uk': '❔ Запитання №9/21:\n' '<b>Жах чи страх?</b>\n\n',

    'answer_10_ru': '❔ Вопрос №10/21:\n'  '<b>Нервозность?</b>\n\n',
    'answer_10_uk': '❔ Запитання №10/21:\n' '<b>Нервовість?</b>\n\n',

    'answer_11_ru': '❔ Вопрос №11/21:\n' '<b>Ощущение удушья?</b>\n\n',
    'answer_11_uk': '❔ Запитання №11/21:\n' '<b>Відчуття задухи?</b> \n\n',

    'answer_12_ru': '❔ Вопрос №12/21:\n' '<b>Дрожь в руках?</b> \n\n',
    'answer_12_uk': '❔ Запитання №12/21:\n' ' <b>Тремтіння в руках?</b> \n\n',

    'answer_13_ru': '❔ Вопрос №13/21:\n' '<b>Дрожь в других частях тела?</b> \n\n',
    'answer_13_uk': '❔ Запитання №13/21:\n' '<b>Тремтіння в інших частинах тіла?</b> \n\n',

    'answer_14_ru': '❔ Вопрос №14/21:\n' '<b>Страх, что не можешь себя контролировать?</b> \n\n',
    'answer_14_uk': '❔ Запитання №14/21:\n' '<b>Страх, що не можеш контролювати себе?</b> \n\n',

    'answer_15_ru': '❔ Вопрос №15/21:\n' '<b>Затрудненность дыхания?</b> \n\n',
    'answer_15_uk': '❔ Запитання №15/21:\n' '<b>Утрудненість дихання?</b>\n\n',

    'answer_16_ru': '❔ Вопрос №16/21:\n' '<b>Страх смерти?</b>\n\n',
    'answer_16_uk': '❔ Запитання №16/21:\n' '<b>Страх смерті?</b>\n\n',

    'answer_17_ru': '❔ Вопрос №17/21:\n' '<b>Уязвимость, боязнь?</b>\n\n',
    'answer_17_uk': '❔ Запитання №17/21:\n' '<b>Вразливість, страх?</b>\n\n',

    'answer_18_ru': '❔ Вопрос №18/21:\n' '<b>Расстройство желудка или пищеварения?</b>\n\n',
    'answer_18_uk': '❔ Запитання №18/21:\n' '<b>Розлад шлунка чи травлення?</b>\n\n',

    'answer_19_ru': '❔ Вопрос №19/21:\n' '<b>Обмороки?</b>\n\n',
    'answer_19_uk': '❔ Запитання №19/21:\n' '<b>Непритомність?</b>\n\n',

    'answer_20_ru': '❔ Вопрос №20/21:\n' '<b>Покраснение лица?</b>\n\n',
    'answer_20_uk': '❔ Запитання №20/21:\n' '<b>Почервоніння обличчя?</b>\n\n',

    'answer_21_ru': '❔ Вопрос №21/21:\n' '<b>Потливость (не по причине перегрева)?</b>\n\n',
    'answer_21_uk': '❔ Запитання №21/21:\n' '▫<b>Пітливість (не через перегрівання)?</b>\n\n'}
test_worry_beka_result = {         #     РЕЗУЛЬТАТ     
       'ru0-9':  '<b>По результатам тестирования у тебя отсутствуют признаки тревожности</b>😌\n\n'

              "Важно понимать, что отсутствие тревожности не является признаком совершенства или нормы. Тревога может быть нормальной реакцией на стрессовые ситуации, "
              "и ее отсутствие может указывать на некоторые проблемы со здоровьем или эмоциональным блоком.\n\n"

              "<b> 🔅 Испытывать тревогу — абсолютно нормально.</b>\n"
              "Это одно из базовых переживаний человека, которое к тому же необходимо для выживания. 🙂 "
              "Тревожность — это реакция центральной нервной системы, которую ты не можешь контролировать самостоятельно.\n\n"
              
              "Но, когда тревога постоянная и чрезмерная, её нельзя игнорировать. Если ты заметишь у кто-то из твоего "
              "круга общения постоянное беспокойство, страх, изоляцию или уменьшение интереса к жизни, вот несколько советов:\n\n"
              
              " 🔅<b> Слушай и поддерживай</b>: <i>Часто просто выслушать человека может помочь ему почувствовать себя лучше. "
              "При этом не стоит перебивать его и не нужно оценивать его чувства.</i>\n\n"

              " 🔅<b> Помоги увидеть рациональную сторону ситуации</b>: <i>Часто люди, страдающие от тревоги, сосредоточены на негативных мыслях и боятся, что случится что-то плохое. "
              "Помоги взглянуть на ситуацию с другой стороны и постараться увидеть положительные моменты.</i>\n\n"

              " 🔅<b> Направь к специалисту</b>: <i>Если тревога слишком серьезная или не уменьшается, рекомендуй обратиться за помощью к психотерапевту.</i>",

       'ru10-21': '<b>По результатам тестирования у тебя есть признаки незначительного уровня тревоги</b> 😌\n\n'

              'Низкая тревожность. Отличная вещь! (если ты реалистичный человек в оценке ситуаций).\n\n'

              'Слишком низкая тревожность может указывать на оторванность от себя, других или своего окружения.\n\n'

              '❕<i> Все люди когда-либо на протяжении жизни испытывают тревогу, кто-то чаще, кто-то реже. '
              'Хотя тревожность и очень распространена, мало кто открыто говорит об этом.</i>\n\n'

              "<b>🔅 Испытывать тревогу — абсолютно нормально.</b> \nЭто одно из базовых переживаний человека, которое к тому же необходимо для выживания. "
              "Тревожность — это реакция центральной нервной системы, которую ты не можешь контролировать самостоятельно.\n\n"

              '<b>Если ты частенько тревожишься, можно в какой-то степени самому помочь себе: </b>\n'

              "🔅 <b>Пытайся повышать свой порог испытываемой тревоги.</b> \n<i>Постепенно помещай себя в ситуации, которые вызывают дискомфорт. </i>"
              "\n<b>Боишься публично выступать?</b><i> Сначала отпрепетируй речь на игрушках. Когда тревога от этого уменьшится, попробуй выступить "
              "перед одним-двумя людьми которым ты доверяешь, и так, постепенно привыкая к раздражителю который вызывает тревогу, ты максимально снизишь её уровень.</i>\n\n"

              "🔅 <b>Занимайся спортом, достаточно спи и ешь.</b> \n<i> Физическое здоровье, хороший сон и нужные организму витамины, "
              " помогут уменьшить стресс и тревогу. Кофеин и алкоголь могут усугубить стресс и беспокойство, поэтому лучше ограничить их потребление.</i> 🙂\n\n"
              
              "<b>Если ты чувствуешь что тревога плохо влияет на твою жизнь, не стесняйся обратиться за помощью к психологу или психотерапевту. "
              "Они могут помочь разобраться с причинами, и найти способы решения проблем.</b>",

       'ru22-35': '<b>По результатам тестирования у тебя признаки средней выраженности тревоги</b> 😯\n\n'

              '<i>❕ Ощущение напряжения или перепадов настроения.\n'
              '❕ Беспокойство или раздражительность.\n'
              '❕ Ожидание ухудшения ситуации и слежение за признаками опасности.\n'
              '❕ Головная боль, постоянное чувство усталости и бессонница.</i>\n\n'

              'Всё это возможные симптомы повышенной тревожности, которые негативно влияют на качество жизни. \n\n'
              "<b>🔅 Испытывать тревогу — абсолютно нормально. 🙂</b> \nЭто одно из базовых переживаний человека, которое к тому же необходимо для выживания. "
              "Тревожность — это реакция центральной нервной системы, которую ты не можешь контролировать самостоятельно.\n\n"

              '<i>Но когда тревога становится постоянной и чрезмерно повышенной, влияя на твою жизнь - не сомневайся и обратись за помощью. '
              'Она редко проходит сама по себе. Но её можно лечить, и лечить вполне успешно.\n\n</i>'

              '<b>Так-как не всегда есть возможность пойти к специалисту, можно в какой-то степени самому помочь себе: </b>\n\n'
              "🔅 <b>Пытайся повышать свой порог испытываемой тревоги.</b> \n<i>Постепенно помещай себя в ситуации, которые вызывают дискомфорт. </i>"
              "\n<b>Боишься публично выступать?</b><i> Сначала отпрепетируй речь на игрушках. Когда тревога от этого уменьшится, попробуй выступить "
              "перед одним-двумя людьми которым ты доверяешь, и так, постепенно привыкая к раздражителю который вызывает тревогу, ты максимально снизишь её уровень.</i>\n\n"

              "🔅 <b>Занимайся спортом, достаточно спи и ешь.</b> \n<i> Физическое здоровье, хороший сон и нужные организму витамины, "
              " помогут уменьшить стресс и тревогу. Кофеин и алкоголь могут усугубить стресс и беспокойство, поэтому лучше ограничить их потребление.</i> 🙂\n\n"

              "<b>Если ты чувствуешь что тревога плохо влияет на твою жизнь, не стесняйся обратиться за помощью к психологу или психотерапевту. "
              "Они могут помочь разобраться с причинами, и найти способы решения проблем.</b>",

       'ru36-63': '<b>По результатам тестирования у тебя есть признаки очень сильной тревожности</b> 😯\n\n'
              '<i>❕ Ощущение напряжения или перепадов настроения.\n'
              '❕ Беспокойство или раздражительность.\n'
              '❕ Ожидание ухудшения ситуации и слежение за признаками опасности.\n'
              '❕ Головная боль, постоянное чувство усталости и бессонница.</i>\n\n'

              'Всё это симптомы повышенной тревожности, которые негативно влияют на качество жизни. \n\n'

              '❕<i> Все люди когда-либо на протяжении жизни испытывают тревогу, кто-то чаще, кто-то реже. '
              'Хотя тревожность и очень распространена, мало кто открыто говорит об этом.</i>\n\n'

              "<b>🔅 Испытывать тревогу — абсолютно нормально. </b> \nЭто одно из базовых переживаний человека, которое к тому же необходимо для выживания. "
              "Тревожность — это реакция центральной нервной системы, которую ты не можешь контролировать самостоятельно.\n\n"

              '<i>Но когда тревога становится постоянной и чрезмерно повышенной, её нельзя оставлять без вмешательства специалистов. '
              'Она редко проходит сама по себе. Но её можно лечить, и лечить вполне успешно.\n\n</i>'

              "🔅 <b>Если ты постоянно чувствуешь тревогу и это мешает тебе жить полной жизнью, не стесняйся обратиться за помощью к профессиональному психологу или терапевту."
              "Они могут помочь разобраться с причинами, и найти способы решения проблем.</b>",

       'ru': '<b>Тест тревожности Бека - это опросник, который помогает оценить, насколько сильно ты тревожишься.</b> 😬\n\n'

              'Тест не даёт окончательного диагноза, но помогает понять, нужна ли тебе дополнительная помощь психолога.\n\n'

              "<i>❗️ Не стоит после его прохождения и получения результатов заниматься самолечением. "
              "Результаты и интерпретации, полученные без участия специалистов, не следует воспринимать слишком серьезно.</i> \n\n"

              '<b>Внимательно изучи каждый вопрос и выбери тот вариант, который беспокоил тебя на протяжении последней недели, включая сегодня.</b>\n\n',

       'uk': '<b>Тест тривожності Бека - це опитувальник, який допомагає оцінити, наскільки сильно ти турбуєшся.</b> 😬\n\n'

              'Тест не дає остаточного діагнозу, але допомагає зрозуміти, чи потрібна тобі додаткова допомога психолога.\n\n'

              "<i>❗️ Не варто після його проходження та отримання результатів займатися самолікуванням. "
              "Результати та інтерпретації, отримані без участі фахівців, не слід сприймати надто серйозно.</i> \n\n"

              '<b>Уважно вивчи кожне запитання та вибери той варіант, який турбував тебе протягом останнього тижня, включаючи сьогоднi.</b>\n\n',

       'uk0-9': '<b>За результатами тестування у тебе відсутні ознаки тривожності</b>😌\n\n'

               "Важливо розуміти, що відсутність тривожності не є ознакою досконалості чи норми. Тривога може бути нормальною реакцією на стресові ситуації, "
               "і її відсутність може вказувати на деякі проблеми зі здоров'ям або емоційним блоком.\n\n"

               "<b> 🔅 Вiдчувати тривогу - абсолютно нормально.</b>\n"
               "Це одне з базових переживань людини, яке до того ж необхідне для виживання. 🙂"
               "Тривожність - це реакція центральної нервової системи, яку ти не можеш контролювати самостійно.\n\n"
              
               "Але, коли тривога постійна та надмірна, її не можна ігнорувати. Якщо ти помітиш у хтось із твого "
               "коло спілкування постійне занепокоєння, страх, ізоляцію або зменшення інтересу до життя, ось кілька порад:\n\n"
              
               " 🔅<b> Слухай і підтримуй</b>: <i>Часто просто вислухати людину може допомогти їй відчути себе краще. "
               "При цьому не варто перебивати його і не потрібно оцінювати його почуття.</i>\n\n"

               " 🔅<b> Допоможи побачити раціональний бік ситуації</b>: <i>Часто люди, які страждають від тривоги, зосереджені на негативних думках і бояться, що станеться щось погане. "
               "Допоможи поглянути на ситуацію з іншого боку і спробувати побачити позитивні моменти.</i>\n\n"

               " 🔅<b> Направте до фахівця</b>: <i>Якщо тривога занадто серйозна або не зменшується, рекомендуй звернутися за допомогою до психотерапевта.</i>",

       'uk10-21': '<b>За результатами тестування у тебе є ознаки незначного рівня тривоги</b> 😌\n\n'

              'Низька тривожність. Відмінна річ! (якщо ти реалістична людина в оцінці ситуацій).\n\n'

              'Занадто низька тривожність може вказувати на відірваність від себе, інших або свого оточення.\n\n'

              '❕<i> Всі люди колись протягом життя відчувають тривогу, хтось частіше, хтось рідше. '
              'Хоча тривожність і дуже поширена, мало хто відкрито говорить про це.</i>\n\n'

              "<b>🔅 Вiдчувати тривогу - абсолютно нормально.</b> \nЦе одне з базових переживань людини, яке до того ж необхідне для виживання. "
              "Тривожність - це реакція центральної нервової системи, яку ти не можеш контролювати самостійно.\n\n"

              '<b>Якщо ти частенько турбуєшся, можна якоюсь мірою самому допомогти собі:</b>\n'

              "🔅 <b>Намагайся підвищувати свій поріг тривоги.</b> \n<i>Поступово поміщай себе в ситуації, які викликають дискомфорт. </i>"
              "\n<b>Боїшся публічно виступати?</b><i> Спочатку відпрепетуй промову на іграшках. Коли тривога від цього зменшиться, спробуй виступити "
              "перед одним-двома людьми яким ти довіряєш, і так поступово звикаючи до подразника який викликає тривогу, ти максимально знизиш її рівень.</i>\n\n"

              "🔅 <b>Займайся спортом, достатньо спи та їж.</b> \n<i>Фізичне здоров'я, хороший сон і потрібні організму вітаміни, "
              " допоможуть зменшити стрес і тривогу. Кофеїн та алкоголь можуть посилити стрес та занепокоєння, тому краще обмежити їх споживання.</i> 🙂\n\n"
              
              "<b>Якщо ти відчуваєш, що тривога погано впливає на твоє життя, не соромся звернутися за допомогою до психолога або психотерапевта. "
              "Вони можуть допомогти розібратися з причинами і знайти способи вирішення проблем.</b>",

       'uk22-35': '<b>За результатами тестування у тебе ознаки середньої вираженості тривоги</b> 😯\n\n'

              '<i>❕ Відчуття напруги або перепадів настрою.\n'
              '❕ Занепокоєння або дратівливість.\n'
              '❕ Очікування погіршення ситуації та стеження за ознаками небезпеки.\n'
              '❕ Головний біль, постійне почуття втоми та безсоння.</i>\n\n'

              'Все це можливі симптоми підвищеної тривожності, які негативно впливають на якість життя. \n\n'
              "<b>🔅 Вiдчувати тривогу - абсолютно нормально. 🙂</b> \nЦе одне з базових переживань людини, яке до того ж необхідне для виживання. "
              "Тривожність - це реакція центральної нервової системи, яку ти не можеш контролювати самостійно.\n\n"

              '<i>Але коли тривога стає постійною та надмірно підвищеною, впливаючи на твоє життя - не сумнівайся і звернися за допомогою. '
              'Вона рідко проходить сама по собі. Але її можна лікувати, і лікувати цілком успішно.\n\n</i>'

              '<b>Так як не завжди є можливість піти до фахівця, можна якоюсь мірою самому допомогти собі: </b>\n\n'
              "🔅 <b>Намагайся підвищувати свій поріг тривоги.</b> \n<i>Поступово поміщай себе в ситуації, які викликають дискомфорт. </i>"
              "\n<b>Боїшся публічно виступати?</b><i> Спочатку відпрепетуй промову на іграшках. Коли тривога від цього зменшиться, спробуй виступити" 
              "перед одним-двома людьми яким ти довіряєш, і так поступово звикаючи до подразника який викликає тривогу, ти максимально знизиш її рівень.</i>\n\n"

              "🔅 <b>Займайся спортом, достатньо спи та їж.</b> \n<i> Фізичне здоров'я, хороший сон та потрібні організму вітаміни, "
              " допоможуть зменшити стрес і тривогу. Кофеїн та алкоголь можуть посилити стрес та занепокоєння, тому краще обмежити їх споживання.</i> 🙂\n\n"

              "<b>Якщо ти відчуваєш, що тривога погано впливає на твоє життя, не соромся звернутися за допомогою до психолога або психотерапевта. "
              "Вони можуть допомогти розібратися з причинами і знайти способи вирішення проблем.</b>",

       'uk36-63': '<b>За результатами тестування у тебе є ознаки дуже сильної тривожності</b> 😯\n\n'
              '<i>❕ Відчуття напруги або перепадів настрою.\n'
              '❕ Занепокоєння або дратівливість.\n'
              '❕ Очікування погіршення ситуації та стеження за ознаками небезпеки.\n'
              '❕ Головний біль, постійне почуття втоми та безсоння.</i>\n\n'

              'Все це симптоми підвищеної тривожності, які негативно впливають на якість життя. \n\n'

              '❕<i> Всі люди колись протягом життя відчувають тривогу, хтось частіше, хтось рідше. '
              'Хоча тривожність і дуже поширена, мало хто відкрито говорить про це.</i>\n\n'

              "<b>🔅 Вiдчувати тривогу - абсолютно нормально. </b> \nЦе одне з базових переживань людини, яке до того ж необхідне для виживання. "
              "Тривожність - це реакція центральної нервової системи, яку ти не можеш контролювати самостійно.\n\n"

              '<i>Але коли тривога стає постійною та надмірно підвищеною, її не можна залишати без втручання фахівців. '
              'Вона рідко проходить сама по собі. Але її можна лікувати, і лікувати цілком успішно.\n\n</i>'

              "🔅 <b>Якщо ти постійно відчуваєш тривогу і це заважає тобі жити повним життям, не соромся звернутися за допомогою до професійного психолога або терапевта. "
              "Вони можуть допомогти розібратися з причинами і знайти способи вирішення проблем.</b>",}

test_hopeless_beka = {             # ТЕСТ БЕЗНАДЁЖНОСТИ БЕКА 
    'answer_1_ru': '❔ Вопрос №1/20: \n\n<b>Я жду будущего с надеждой и энтузиазмом.</b>',
    'answer_1_uk': '❔ Запитання №1/20: \n\n<b>Я чекаю майбутнього з надією та ентузіазмом. </b>',

    'answer_2_ru': '❔ Вопрос №2/20: \n\n<b>Мне пора сдаться, так как я ничего не могу изменить к лучшему.</b>',
    'answer_2_uk': '❔ Запитання №2/20: \n\n<b>Мені час здатися, так як я нічого не можу змінити на краще. </b>',

    'answer_3_ru': '❔ Вопрос №3/20: \n\n<b>Когда дела идут плохо, мне помогает мысль, что так не может продолжаться всегда.</b>',
    'answer_3_uk': '❔ Запитання №3/20: \n\n<b>Коли справи йдуть погано, мені допомагає думка, що так не може тривати завжди.</b>',

    'answer_4_ru': '❔ Вопрос №4/20: \n\n<b>Я не могу представить, на что будет похожа моя жизнь через 10 лет.</b>',
    'answer_4_uk': '❔ Запитання №4/20: \n\n<b>Я не можу уявити, на що буде схоже моє життя через 10 років. </b>',

    'answer_5_ru': '❔ Вопрос №5/20: \n\n<b>У меня достаточно времени, чтобы завершить дела, которыми я больше всего хочу заниматься.</b>',
    'answer_5_uk': '❔ Запитання №5/20: \n\n<b>Я маю достатньо часу, щоб завершити справи, якими я найбільше хочу займатися. </b>',

    'answer_6_ru': '❔ Вопрос №6/20: \n\n<b>В будущем, я надеюсь достичь успеха в том, что мне больше всего нравится.</b>',
    'answer_6_uk': '❔ Запитання №6/20: \n\n\n<b>У майбутньому я сподіваюся досягти успіху в тому, що мені найбільше подобається. </b>',

    'answer_7_ru': '❔ Вопрос №7/20: \n\n<b>Будущее мне представляется мне во тьме.</b>',
    'answer_7_uk': '❔ Запитання №7/20: \n\n<b>Майбутнє мені видається мені в темряві. </b>',

    'answer_8_ru': '❔ Вопрос №8/20: \n\n<b>Я надеюсь получить в жизни больше хорошего, чем средний человек.</b>',
    'answer_8_uk': '❔ Запитання №8/20: \n\n<b>Я сподіваюся отримати в житті більше гарного, ніж середня людина.</b>',

    'answer_9_ru': '❔ Вопрос №9/20: \n\n<b>У меня нет никаких просветов и нет причин верить, что они появятся в будущем.</b>',
    'answer_9_uk': '❔ Запитання №9/20: \n\n<b>У мене немає жодних просвітів і немає причин вірити, що вони з\'являться у майбутньому. </b>',

    'answer_10_ru': '❔ Вопрос №10/20: \n\n<b>Мой прошлый опыт хорошо меня подготовил к будущему.</b>',
    'answer_10_uk': '❔ Запитання №10/20: \n\n<b>Мій минулий досвід добре підготував мене до майбутнього. </b>',

    'answer_11_ru': '❔ Вопрос №11/20: \n\n<b>Всё, что я вижу впереди - скорее, неприятности, чем радости. </b>',
    'answer_11_uk': '❔ Запитання №11/20: \n\n<b>Все, що я бачу попереду – скоріше, неприємності, ніж радості. </b>',

    'answer_12_ru': '❔ Вопрос №12/20: \n\n<b>Я не надеюсь достичь того, чего действительно хочу. </b>',
    'answer_12_uk': '❔ Запитання №12/20: \n\n<b>Я не сподіваюся досягти того, чого справді хочу. </b>',

    'answer_13_ru': '❔ Вопрос №13/20: \n\n<b>Когда я заглядываю в будущее, я надеюсь быть счастливее, чем есть сейчас. </b>',
    'answer_13_uk': '❔ Запитання №13/20: \n\n<b>Коли я заглядаю в майбутнє, я сподіваюся бути щасливішим, ніж є зараз. </b>',

    'answer_14_ru': '❔ Вопрос №14/20: \n\n<b>Дела идут не так, как мне хочется. </b>',
    'answer_14_uk': '❔ Запитання №14/20: \n\n<b>Справи йдуть не так, як мені хочеться. </b>',

    'answer_15_ru': '❔ Вопрос №15/20: \n\n<b>Я сильно верю в своё будущее. </b>',
    'answer_15_uk': '❔ Запитання №15/20: \n\n<b>Я дуже вірю у своє майбутнє. </b>',

    'answer_16_ru': '❔ Вопрос №16/20: \n\n<b>Я никогда не достигаю того, что хочу, поэтому глупо что-либо хотеть. </b>',
    'answer_16_uk': '❔ Запитання №16/20: \n\n<b>Я ніколи не досягаю того, що хочу, тому безглуздо щось хотіти. </b>',

    'answer_17_ru': '❔ Вопрос №17/20: \n\n<b>Весьма маловероятно, что я получу реальное удовлетворение в будущем. </b>',
    'answer_17_uk': '❔ Запитання №17/20: \n\n<b>Неймовірно, що я отримаю реальне задоволення в майбутньому. </b>',

    'answer_18_ru': '❔ Вопрос №18/20: \n\n<b>Будущее представляется мне расплывчатым и неопределённым. </b>',
    'answer_18_uk': '❔ Запитання №18/20: \n\n<b>Майбутнє видається мені розпливчастим та невизначеним. </b>',

    'answer_19_ru': '❔ Вопрос №19/20: \n\n<b>В будущем меня ждёт больше хороших дней, чем плохих. </b>',
    'answer_19_uk': '❔ Запитання №19/20: \n\n<b>У майбутньому на мене чекає більше хороших днів, ніж поганих. </b>',

    'answer_20_ru': '❔ Вопрос №20/20: \n\n<b>Бесполезно пытаться получить то, что я хочу, потому что, вероятно, я не добьюсь этого. </b>',
    'answer_20_uk': '❔ Запитання №20/20: \n\n<b>Марно намагатися отримати те, що я хочу, тому що, мабуть, я не досягну цього. </b>'}
test_hopeless_beka_result = {      #     РЕЗУЛЬТАТ     

    'answer_ru':  '<b>Чувство безнадежности у некоторых может возникать время от времени при тяжелых ситуациях и стрессе, и быстро проходить. </b>'
              'А у других оно может сопровождать депрессию и значительно влиять на поведение в негативную сторону.\n\n'

              'Шкала безнадёжности, разработанная на основе теории Бека, поможет выявить твоё отношение к своему будущему, '
              'видишь ли ты его радужным и успешным или же тебе кажется, что оно не сулит ничего хорошего.\n\n'

              "<i>❗️ Не стоит после его прохождения и получения результатов заниматься самолечением. "
              "Результаты и интерпретации, полученные без участия специалистов, не следует воспринимать слишком серьезно.</i> \n\n"

              "Внимательно прочти каждое и отметь одно верное утверждение, которое наиболее точно отражает Твои чувства в настоящее время.\n"
              "<b>Среди утверждений нет правильных или неправильных.</b>",

    'answer_uk':  '<b>Почуття безнадійності у когось може виникати час від часу при важких ситуаціях і стресі, та швидко проходити. </b>'
              'А в інших воно може супроводжувати депресію та значно впливати на поведінку в негативний бік.\n\n'

              'Шкала безнадійності, розроблена на основі теорії Бека, допоможе виявити твоє ставлення до свого майбутнього, '
              'Чи ти бачиш його райдужним й успішним або ж тобі здається, що воно не обіцяє нічого доброго. \n\n'

              "<i>❗️ Не варто після його проходження та отримання результатів займатися самолікуванням."
              "Результати та інтерпретації, отримані без участі фахівців, не слід сприймати надто серйозно.</i> \n\n"

              "Уважно прочитай кожне та відзнач одне вірне твердження, яке найбільш точно відображає Твої почуття в даний час.\n"
              "<b>Серед тверджень немає правильних або неправильних.</b>",

    "ru_0-3":     "По результатам тестирования у тебя<b> Отсутвует безнадёжность. 😌</b>\n\n"

              " 🔅 Твоим убеждениям можно позавидовать 🙂, ты с оптимизмом и уверенностью смотришь в будущее.\n\n"

              "Но, к сожалению, не всем удаётся так оптимистично оценивать свою жизнь. Если ты заметишь у кто-то из твоего "
              "круга общения постоянное чувство тоски, снижение интереса к жизни, вялость или суицидальные мысли, вот несколько советов:\n\n"

              " 🔅<b> Слушай и поддерживай</b>: <i>Позволь человеку выразить свои чувства и переживания. Слушай его внимательно, без прерываний и суждений. "
              "Объясни, что чувство безнадежности - это обычное состояние и что оно не означает, что он не справится со своими проблемами.</i>\n\n"

              " 🔅<b> Организуй досуг и поощряй здоровый образ жизни</b>: <i>Предложи заняться совместными увлечениями, пойти в кино, на концерт или прогуляться по парку. "
              "Поощри здоровый образ жизни, включая физические упражнения, здоровое питание и достаточный сон.</i>\n\n"

              " 🔅<b> Направь к специалисту</b>: <i>Помни, что если состояние человека не улучшается, ему может потребоваться помощь психолога или психотепевта. "
              " Направь его к профессионалу и помоги найти подходящего специалиста.</i>",

    "ru_4-8":     "По результатам тестирования у тебя есть признаки<b> Лёгкой безнадёжности. 😶‍🌫️</b>\n\n"

              " 🔅 Уровень легкой безнадеги не оказывает сильного воздействия на мировосприятие человека. 🙂\n\n"

              "<i>При нем достаточно применить самовнушение, припомнить положительные моменты, успехи. "
              "Важно социализироваться: назначить встречу с друзьями, сходить в кино или театр. "
              "Уже планирование такого незначительного мероприятия отвлечет от грустных мыслей и поможет положительно настроиться. </i>\n\n"

              " 🔅 Так же исследования показывают, что длительное пребывание в закрытых помещениях может ухудшать настроение и усиливать чувство безнадежности."

              "<b>Развивай свои навыки: </b>Изучение новых навыков и увлечений может помочь повысить уверенность в себе и придать чувство ценности. "
              "А развлечения и хобби могут помочь расслабиться и отвлечься от негативных мыслей.\n\n",

    "ru_9-14":    "По результатам тестирования у тебя есть признаки<b> Умеренной безнадёжности. 😯</b>\n\n"

    " 🔅 Безнадежность зачастую один из симптомов депрессии.\n\n"

    "<i>Она не позволяет человеку даже представить, что возможна жизнь без депрессии. "
    "Что существует такое «место», куда из депрессии можно было бы «выйти». "
    "<b>И как бы не был близок выход – если мы не верим в него, не верим в нашу способность дойти до него – он будет казаться безнадежно далёк.</b></i>\n\n"

    " 🔅 При умеренном уровне безнадежности хороший эффект дадут сеансы с психологом. "
    "<i>Возможность высказаться позволит разобраться в первопричинах появления негативного мировоззрения и вернет веру в будущее.</i>\n\n"

    " 🔅 Так же исследования показывают, что длительное пребывание в закрытых помещениях может ухудшать настроение и усиливать чувство безнадежности.\n\n"

    "<b>Развивай свои навыки: </b>Изучение новых навыков и увлечений может помочь повысить уверенность в себе и придать чувство ценности. "
    "А развлечения и хобби могут помочь расслабиться и отвлечься от негативных мыслей.\n\n"

    "<b>Если твоё состояние не улучшается, не стесняйся обратиться за помощью к психологу или психотерапевту. "
    "Они могут помочь разобраться с причинами твоей безнадежности и найти способы решения проблем.</b>",

    "ru_15-20":   "По результатам тестирования у тебя есть признаки<b> Тяжёлой безнадёжности. 😯</b>\n\n"

              " 🔅 Безнадежность зачастую один из симптомов депрессии.\n\n"

              "<i> Она не позволяет человеку даже представить, что возможна жизнь без депрессии. "
              "Что существует такое «место», куда из депрессии можно было бы «выйти». "
              "<b>И как бы не был близок выход – если мы не верим в него, не верим в нашу способность дойти до него – он будет казаться безнадежно далёк.</b></i>\n\n"

              " 🔅 Так же исследования показывают, что длительное пребывание в закрытых помещениях может ухудшать настроение и усиливать чувство безнадежности.\n\n"

              "<b>Если твоё состояние не улучшается, не стесняйся обратиться за помощью к психологу или психотерапевту. "
              "Они могут помочь разобраться с причинами твоей безнадежности и найти способы решения проблем.</b>",

    "uk_0-3":     "За результатами тестування у тебе <b>Відсутня безнадійність. 😌</b>\n\n"

                     " 🔅 Твоїм переконанням можна позаздрити 🙂, ти з оптимізмом та впевненістю дивишся в майбутнє.\n\n"

                     "Але, на жаль, не всім вдається так оптимістично оцінювати своє життя. Якщо ти помітиш у когось із твого "
                     "коло спілкування постійне почуття туги, зниження інтересу до життя, млявість або суїцидальні думки, ось кілька порад:\n\n"

                     " 🔅<b> Слухай та підтримуй</b>: <i>Дозволь людині висловити свої почуття та переживання. Слухай її уважно, без переривань та суджень. "
                     "Поясни, що почуття безнадійності - це звичайний стан і що воно не означає, що він не впорається зі своїми проблемами.</i>\n\n"

                     " 🔅<b> Організуй дозвілля і заохочуй здоровий спосіб життя</b>: <i>Запропонуй зайнятися спільними захопленнями, піти в кіно, на концерт або прогулятися парком. "
                     "Заохочуй здоровий спосіб життя, включаючи фізичні вправи, здорове харчування та достатній сон.</i>\n\n"

                     " 🔅<b> Направ до фахівця</b>: <i>Пам'ятай, що якщо стан людини не покращується, йому може знадобитися допомога психолога або психотепевта. "
                     "Направ його до професіонала і допоможи знайти відповідного фахівця.</i>",

    "uk_4-8":     "За результатами тестування у тебе є ознаки<b> Легкої безнадійності. 😶‍🌫️</b>\n\n"
              " 🔅 Рівень легкої безнадії не чинить сильного впливу на світосприйняття людини. 🙂\n\n"

              "<i>При ньому достатньо застосувати самонавіювання, пригадати позитивні моменти, успіхи. "
              "Важливо соціалізуватися: призначити зустріч із друзями, сходити в кіно чи театр. "
              "Вже планування такого незначного заходу відверне увагу від сумних думок і допоможе позитивно налаштуватися. </i>\n\n"

              " 🔅 Також дослідження показують, що тривале перебування в закритих приміщеннях може погіршувати настрій і посилювати почуття безнадійності. "

              "<b>Розвивай свої навички: </b>Вивчення нових навичок та захоплень може допомогти підвищити впевненість у собі та надати почуття цінності. "
              "А розваги та хобі можуть допомогти розслабитися та відволіктися від негативних думок.\n\n",

    "uk_9-14":    "За результатами тестування ти маєш ознаки<b> Помірної безнадійності. 😯</b>\n\n"

              " 🔅 Безнадійність часто один із симптомів депресії.\n\n"

              "<i>Вона не дозволяє людині навіть уявити, що можливе життя без депресії. "
              "Що існує таке «місце», куди з депресії можна було б «вийти». "
              "<b>І як би не був близький вихід - якщо ми не віримо в нього, не віримо в нашу здатність дійти до нього - він здаватиметься безнадійно далеким.</b></i>\n\n"

              "🔅 При помірному рівні безнадійності хороший ефект дадуть сеанси з психологом. "
              "<i>Можливість висловитися дозволить розібратися в причинах появи негативного світогляду і поверне віру в майбутнє.</i>\n\n"

              " 🔅 Також дослідження показують, що тривале перебування в закритих приміщеннях може погіршувати настрій і посилювати почуття безнадійності.\n\n"

              "<b>Розвивай свої навички: </b>Вивчення нових навичок та захоплень може допомогти підвищити впевненість у собі та надати почуття цінності. "
              "А розваги та хобі можуть допомогти розслабитися та відволіктися від негативних думок.\n\n"

              "<b>Якщо твій стан не покращується, не соромся звернутися за допомогою до психолога або психотерапевта. "
              "Вони можуть допомогти розібратися з причинами твоєї безнадійності та знайти способи вирішення проблем.</b>",

    "uk_15-20":   "За результатами тестування у тебе є ознаки<b> Тяжкої безнадійності. 😯</b>\n\n"

              " 🔅 Безнадійність часто один із симптомів депресії.\n\n"

              "<i> Вона не дозволяє людині навіть уявити, що можливе життя без депресії. "
              "Що існує таке «місце», куди з депресії можна було б «вийти». "
              "<b>І як би не був близький вихід - якщо ми не віримо в нього, не віримо в нашу здатність дійти до нього - він здаватиметься безнадійно далеким.</b></i>\n\n"

              " 🔅 Також дослідження показують, що тривале перебування в закритих приміщеннях може погіршувати настрій та посилювати почуття безнадійності.\n\n"

              "<b>Якщо твій стан не покращується, не соромся звернутися за допомогою до психолога або психотерапевта. "
              "Вони можуть допомогти розібратися з причинами твоєї безнадійності та знайти способи вирішення проблем.</b>"

}


duff = ['Пиздобратия мандопроушечная', 'Уёбище залупоглазое', 'Дрочепиздище хуеголовое', 'Пробиздоблядская мандопроушина',
        'Гнидопаскудная хуемандовина', 'Блядь ты семитаборная', 'Охуевшее блядепиздопроёбище', 'Хуй тебе в глотку через анальный проход',
        'Распизди тебя тройным перебором через вторичный переёб', 'Пиздоблятское хуепиздрическое мудовафлоебище сосущее километры трипперных членов',
        'Трихломидозопиздоеблохуеблядеперепиздическая спермоблевотина', 'Гондон с гонореей....',
        'Да разъебись ты троебучим проебом сперматоблятская пиздапроебина охуевающая в своей пидарастической сущности похожаю на ебущегося в жопу енота, сортирующего яйца в пизде кастрированной кобылы',
        'Хуелептический пиздопрозоид, еблоухий мандохвост', 'Ебун хуеголовый', 'Пидрасня ебаная', 'Залупоголовая блядоящерица', 'Трипиздоблядская промудохуина!',
        'Распроеб твою в крестище через коромысло в копейку мать', 'Что за блядская пиздопроебина, охуевающая своей пидорестической заебучестью невъебенной степени охуения.',
        'Заебись невъебенным проебом тримандоблядская пиздопроебина воспиздозаолупоклинившаяся в собственном злопиздии',
        'Что сидишь, как лунь пизду склевавший, мордоблядина залупоглазая. Ебись ты триебучим проебом пиздуй пока трамваи ходят, склипездень двужопостворчатый',
        'Злоебучее страхопиздище трипиздоблятский мандопроеб найвыебенищее распиздоблятство!', 'Застрявший в ебенгво гавнопрягопизд отпизднутый', 'Хуеблища и ебанагандонный хуепедераст',
        'Мудагавнопердь', 'Стоебучее страхопиздище охуевающее в собственной пидарастической злоебучести', 'Cемиголовый восьмихуй с четырьмя пиздопроебинами',
        'Облямудевшая страпиздихуюлина', 'Пидористический мудаблядин', 'Трипездоклятый мудопроеб', 'Промудохуеблядская пиздопроебина невьебенно охуевающая от своей собственной облядипизденелости',
        'Трипиздоблядское мудопроебное трипиздие', 'Ебоблядище охуевающее от собственной злоебучести', 'Облямуденный злоебучий страхопизднутый трихуемандаблядский ебаквакнутый',
        'Да разъебись ты триебучим проебом хуепуполо залупоглазое, промонодблядская трипиздыпроебина', 'Хуеблядская пиздопроебина',
        'Да разъебись ты тризлоебучим пробиздом тримандаблядская пиздопроушина охуевающая от собственного блядского невъебения!!', 'Высохший аналомокроблядник', 'Жирномногоканальный блядохероблядник',
        'Пизданутый попечитель мочалок', 'Толстомудый и плюшевый муфлон', 'Жирномногоканальный говноед']

name_sex = ['Александром', 'Сашей', 'Алексеем', 'Алиной', 'Анастасией', 'Анатолием', 'Анной', 'Арсеном', 'Богданом', 'Булатом', 'Вероникой',
            'Виктором', 'Викторией', 'Виталием', 'Владом', 'Геннадием', 'Давидом', 'Данилом', 'Дариной', 'Дарьей', 'Дениской', 'Димой', 'Женей', 'Егором',
            'Катей', 'Леной', 'Елизаветой', 'Ириной', 'Кариной', 'Максимом', 'Маратом', 'Марией', 'Милена', 'Мухаммедом', 'Надеждой', 'Никой', 'Оксаной',
            'Ольгой', 'Полиной', 'Райаном Гослингом', 'Маргаритой', 'Сергеем', 'Софией', 'Стасом', 'Татьяной', 'Яной', 'Денисом', 'cобой', 'никем', 'Cпартаком']

settings = {'language_ru': 'Язык: Русский',
            'language_uk': 'Мова: Українська 🇺🇦',
            'notice_1_ru': 'Уведомления: Вкл. 🔔',
            'notice_0_ru': 'Уведомления: Выкл. 🔕',
            'notice_1_uk': 'Повідомлення: Вкл. 🔔',
            'notice_0_uk': 'Повідомлення: Викл. 🔕',
            'man_ru':      'Пол: Парень👨',
            'man_uk':      'Стать: Хлопець 👨',
            'woman_ru':    'Пол: Девушка 👩',
            'woman_uk':    'Стать: Дівчина 👩',
            'name_ru':     'Имя: ',
            'name_uk':     'Iм`я: '}
